[
  {
    "jobs": [
      {
        "url": "https://www.freelancer.com/projects/iphone-app-development/college-board-like-practice-test",
        "title": "College Board-like Practice Test App",
        "salary": "$4191",
        "company": "",
        "location": "",
        "skillset": "Android, iPad, iPhone, Mobile App Development, Objective C",
        "date of posting": "2025-02-06T16:59:01.762Z",
        "job_description": "I'm looking for a developer to create an application similar to the ...content which I can input into the app for various subjects, including Math, Science, and English. The ability for users to access and take these practice tests. Please note that the app should not have the functionality for users to upload their own practice test content. Ideal Skills and Experience: - Experience in app development, particularly educational apps. - Ability to create an intuitive and user-friendly interface. - Experience with implementing content into an app. - Understanding of the requirements for creating a practice test app. The app should be developed for Windows/IOS platforms. Include basic performance data tracking for users within the app. The app should include...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/java/sentiment-analysis-using-python-windows-38799445",
        "title": "Sentiment Analysis using Python, Windows OS/ I need a Junior Level developer",
        "salary": "$6 / hr",
        "company": "",
        "location": "Pakistan or India",
        "skillset": "Java, Machine Learning (ML), Python, Software Architecture, Statistics",
        "date of posting": "2025-02-06T16:59:01.762Z",
        "job_description": "I need from Pakistan or India. I need a Junior Level Freelancer who has good skills in Sentiment Analysis using Python. It will use Windows OS. I need a serious and hard working person.",
        "experience_required": "Junior Level"
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/seeking-creative-minds-for-future",
        "title": "Seeking Creative Minds for Future Projects",
        "salary": "$298",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Excel",
        "date of posting": "2025-02-06T16:59:01.762Z",
        "job_description": "I am a hard-working and driven individual who isn't afraid to face a challenge. I'm passionate about my work and I know how to get the job done. I would describe myself as an open and honest person who doesn't believe in misleading other people and tries to be fair in everything I do.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/animation/animated-science-shorts",
        "title": "Animated Science Shorts",
        "salary": "$19",
        "company": "",
        "location": "",
        "skillset": "3D Animation, After Effects, Animation, Ghostwriting, Video Editing",
        "date of posting": "2025-02-06T16:59:01.762Z",
        "job_description": "I'm looking for a creator to produce 30 science shorts with a focus on scientific facts and theories aimed at teenagers. The style of these shorts should be similar to the provided Youtube link, using animated graphics for presentation. Key Requirements: - Proven experience in creating engaging animated graphics - Prior work with educational content, specifically aimed at teenagers - Ability to convey scientific facts and theories in a captivating manner. Please note, the total budget for this project is 500 INR for all 30 videos. To demonstrate you've read this brief in full, please include the code \"IAMPRO\" in your proposal. I will require previous examples of your work before we start.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/mathematics/science-course-development-for-all",
        "title": "Science Course Development for All Ages",
        "salary": "$3 / hr",
        "company": "",
        "location": "",
        "skillset": "Article Writing, Education & Tutoring, Mathematics, Research Writing, Scientific Research",
        "date of posting": "2025-02-06T16:59:01.762Z",
        "job_description": "I'm looking for a knowledgeable and engaging science teacher to develop courses for our website. The courses should cover a wide range of topics in science, including physics, astronomy, and mathematics, suitable for any age group. Key Responsibilities: - Develop comprehensive science courses, with a focus on astronomy - Create engaging content for students of all age groups - Ensure courses cover physics and mathematics as well. Ideal Skills: - Strong background in science, particularly astronomy - Experience in teaching and course development - Ability to create engaging and accessible content for all age groups. The courses should be delivered in a video format, and can be of any length ranging from 2-80 hours. The videos...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/research/commerce-virtual-assistant-for-ongoing-39063546",
        "title": "E-commerce Virtual Assistant for Ongoing Basis - 2",
        "salary": "$4 / hr",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Research, Virtual Assistant",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "Looking for Virtual Assistants who has the following skills: Good with excel, High attention to details, Is smart & fast in their work, Self learner & able to follow user guides, Meet deadlines, Proactive & willing to go the extra mile. Job Responsibility: Data Entry & basic admin tasks, Do some research jobs related to products and purchase, Online search for suppliers/ whole sellers/ manufacturer who can give quality products at a very competitive price.",
        "experience_required": "Freshers can also apply"
      },
      {
        "url": "https://www.freelancer.com/projects/python/machine-learning-analysis-the-data",
        "title": "Machine learning analysis the data",
        "salary": "$132",
        "company": "",
        "location": "",
        "skillset": "Data Mining, Machine Learning (ML), Python, Statistics",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "I'm a beginner in Machine Learning and I need a scholar in data science who can help me develop my skills and gain confidence. I am familiar with Python and I would like to focus on Machine Learning specifically. Key Responsibilities: I have data and need to do machine learning for the prediction for better service and improve the service for the customer. I need to the analysis the data using the machine learning.",
        "experience_required": "Beginner in Machine Learning"
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/data-entry-job-application-specialist",
        "title": "Data Entry & Job Application Specialist",
        "salary": "$119",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Research, Virtual Assistant, Web Search",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "Looking for a detail-oriented Filipino individual to assist with job applications and data entry. Key Responsibilities: Apply to jobs on various platforms on behalf of clients, including LinkedIn, modify resumes as needed to suit job applications, communicate with team members via Slack, attend bi-weekly meetings on Google Meet. Working Conditions: Minimum 4-hour work days, Monday to Saturday, Afternoon to evening commitments, time varies.",
        "experience_required": "Previous experience in data entry or job application assistance will be an asset"
      },
      {
        "url": "https://www.freelancer.com/projects/chatgpt/job-application-automation-agent",
        "title": "AI Job Application Automation Agent",
        "salary": "$143",
        "company": "",
        "location": "",
        "skillset": "ChatGPT, Database Administration, Python, Software Architecture, Zapier",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "I want to create an AI agent that automates my job application process. This personal project involves: Job scraping from multiple platforms: LinkedIn, Indeed, Glassdoor, reed, and monster. Resume matching: The AI should be able to match keywords in my resume with the skills required for the job. Applying for jobs: The AI will send my cover letter and resume to HR. Additionally, the AI should create a list of jobs in Google Sheets.",
        "experience_required": "Experience in AI development, specifically in creating job application bots"
      },
      {
        "url": "https://www.freelancer.com/projects/python/sql-python-assessment-creation",
        "title": "SQL & Python Assessment Creation",
        "salary": "$6 / hr",
        "company": "",
        "location": "",
        "skillset": "Database Administration, Database Programming, MySQL, Python, SQL",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "I'm looking for an experienced data professional who can help me prepare a set of complex SQL and Python analytics questions. The purpose of these questions is to assess the suitability of a candidate for a data-oriented role in our company. The questions should be diverse, covering various aspects of data manipulation and retrieval, with a few touching on database design and performance optimization.",
        "experience_required": "Experience in SQL and Python"
      },
      {
        "url": "https://www.freelancer.com/projects/content-writing/content-creation-optimization-for",
        "title": "Content Creation and Optimization for Science & Tech YouTube Channel",
        "salary": "$78",
        "company": "",
        "location": "",
        "skillset": "Article Writing, Content Writing, Copywriting, Creative Writing, Ghostwriting",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "I'm looking for a freelancer who can help me create engaging content for a new YouTube channel focused on educational tutorials and how-tos in the Ai field. Key Responsibilities: Develop engaging, informative, and accurate educational content, Optimize video content for maximum reach and engagement, Implement SEO strategies specific to YouTube.",
        "experience_required": "Proven experience in content creation for YouTube"
      },
      {
        "url": "https://www.freelancer.com/projects/research-writing/patient-monitoring-dsr-protocol",
        "title": "Patient Monitoring & DSR Protocol Literature Review",
        "salary": "$79",
        "company": "",
        "location": "",
        "skillset": "Academic Writing, Article Writing, Network Administration, Research Writing, Technical Writing",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "A list of all 50 references used in the literature review (in APA or IEEE format). A plagiarism report (less than 10%). An AI report (=0).",
        "experience_required": "Strong background in academic writing, Wireless Sensor Networks (WSN, routing protocols, and healthcare automation"
      },
      {
        "url": "https://www.freelancer.com/projects/research/environmental-studies-modern-history",
        "title": "Environmental Studies & Modern History Research",
        "salary": "$106",
        "company": "",
        "location": "",
        "skillset": "Medical, Medical Writing, Research, Research Writing, Scientific Research",
        "date of posting": "2025-02-06T16:59:00.837Z",
        "job_description": "Looking for someone to analyze an academic paper focused on the energy sector within the realm of science. The analysis should specifically cover the experimental results presented in the paper. Key Requirements: Expertise in the energy sector of science, Strong skills in analyzing experimental results, Ability to provide clear and concise interpretations of findings.",
        "experience_required": "Strong research skills"
      },
      {
        "url": "https://www.freelancer.com/projects/ai-hw-sw/system-development-for-multifaceted",
        "title": "AI System Development for Multifaceted Operations",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "...forums, and real-world applications. Areas of learning must include (but are not limited to): Hacking & Cybersecurity: Ethical hacking, penetration testing, security exploits, encryption, and counter-attacks. Programming & Development: Python, Perl, .NET, C, C++, C#, Java, PHP, JavaScript, and more. Electronics & Hardware Engineering: IoT, embedded systems, circuit design, and hardware hacking. Science & Technology: AI research, quantum computing, biotechnology, robotics, and space technology. History & Intelligence: Historical analysis, military strategies, geopolitics, and intelligence operations. Online Business & Finance: Passive income strategies, gambling algorithms, high-risk investments, cryptocurrency trading, and advanced financial analysis.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/physics/depth-data-analytics-research-review",
        "title": "In-Depth Data Analytics Research Review",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "I'm seeking an experienced professional with extensive knowledge in science and technology, particularly in Data Analytics within the Information Technology sector. Your role will involve critically evaluating and collaborating on my research project to improve its validity and accuracy. Key Responsibilities: - Critically analysing the obtained data for logical consistency and scientific rigour. - Drawing logical and insightful conclusions. - Evaluating and validating mathematical formulas for accuracy and appropriateness. - Making corrects and improvements to mathematical formulas where necessary with accompanied explanations. - Checking citations for suitability. - Providing recommendations for the best future direction of research in current academic and technical fields.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/jobs/ai-hw-sw/",
        "title": "AI (Artificial Intelligence) HW/SW",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/lead-generation/cold-callers-appointment-setters-base",
        "title": "Cold Callers & Appointment Setters – Base Pay + High Commissions for Web, AI, and Branding Services",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "Hexaflare is a fast-growing digital agency specializing in Web Development, AI Solutions, and Branding & Design. We’re expanding our outreach team and looking for ambitious cold callers who can engage businesses, pitch services, and close deals or set qualified appointments. What’s in it for you? Base Salary: $250–$550/month (depending on performance and experience). Generous Commissions: Web Development: 25% commission for projects up to $5,000 20% commission for $5,000–$15,000 10–15% for $15,000+ AI Solutions (Chatbots, Automation, etc.): 20% for standard AI solutions 15% for high-complexity AI implementations Branding & Design Services: 25% commission for projects up to $3,000 20% for $3,000–$10,000 15% for $10,000+ No Earnings Cap...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/korean-community-database-creation",
        "title": "Korean Community Database Creation",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "...pricing, and locations) Job listings (companies hiring, job seekers, and salary details) Worker recruitment (businesses looking for employees) Shopping information (where to buy items, price comparisons) This data will be used for my new service website, which will provide clients with quick and reliable answers to their needs. Additional Requirement: Since most of the listings are in Korean, we may need to translate some information into English to better understand the content before structuring it. However, the final database should be in Korean to maintain accuracy and usability for our target audience. Requirements: Experience in data collection, categorization, and Excel formatting Ability to extract and organize data efficiently from online sources",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/job-application-assistant-needed-just",
        "title": "Job Application Assistant Needed (just need to apply for jobs)",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "I'm seeking an experienced professional to assist me in applying for freelance jobs in the technology sector. Your role will involve: - Identifying suitable job openings on LinkedIn, Indeed, and Glassdoor - Crafting compelling, tailored applications for each job - Keeping track of submission statuses Attention to detail and strong communication skills are crucial as you'll be representing me in this process. If you have a proactive approach and a knack for job hunting, I look forward to your application.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/wordpress/troubleshoot-advanced-custom-fields-bug",
        "title": "Virtual Assistant Needed in Malaysia",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "Location: Malaysia (Remote or Hybrid Option) Job Type: Full-Time (160 hours/month, 8 hours/day, Mon-Fri) We are seeking a skilled virtual sales assistant to join our dynamic team. The ideal candidate will be responsible for: - Closing sales. - Providing administrative support to the sales team. Requirements: - Fluent in English, Malay, and Mandarin (both written and spoken). - Strong sales experience with excellent communication and negotiation skills. - Ability to work independently and manage time effectively. - A reliable internet connection for remote work. Benefits: - Flexible work environment (Remote or Hybrid). - Competitive salary with growth opportunities. If you are passionate about sales and ready to contribute to a growing team, we want to hear from you!",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/php/novice-full-stack-web-developer",
        "title": "Novice Full-Stack Web Developer (Internship-Like Position) – 20k PKR/Month",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "We are looking for a junior Full-Stack Web Developer for an internship-like role, ideal for fresh developers seeking real-world experience. Requirements: The selected candidate should have: - Basic knowledge of front-end and back-end development - Ability to work with custom themes and plugins - Strong problem-solving and debugging skills - Eagerness to learn and grow in a professional environment - Must be respectful, professional, and committed to meeting deadlines Experience: Prior internships or projects in web development are a plus but not mandatory. Performance-Based Salary Increase: If the developer's work meets expectations, their salary will be increased. Tasks must be completed on time as assigned. This is a great opportunity for fresh developers looking to gain hands-on experience in a professional setting.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/articles/corporate-mid-level-resume-builder",
        "title": "Corporate Mid-Level Resume Builder",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "I'm looking for a professional resume writer to help me craft a compelling resume aimed at corporate, office jobs. As a mid-level professional, my resume needs to reflect my skills and experience in a way that stands out to potential employers. Key areas to focus on: - Professional Summary - Work Experience - Education - Certificates - Skills - Personal Details Ideal candidates for this project should have a strong understanding of corporate resume standards, excellent writing skills, and the ability to present my qualifications in a persuasive manner. Prior experience in HR or recruitment would be an advantage.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/android/multi-food-delivery-app-for",
        "title": "Multi-Food Delivery App for Android",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2025-02-06T16:58:59.186Z",
        "job_description": "I'm looking for an Android app that can integrate multiple food delivery services - DoorDash, Uber Eats, Grub Hub, and Slice - into a single interface. The primary functionality of the app should be order aggregation from these platforms. Key Requirements: - The app should aggregate orders from all selected food delivery services to make it easier to manage multiple deliveries. - It needs to send all orders to one thermal printer, so experience with printer management in app development is a plus. - The app should be compatible exclusively with Android devices. Ideal Skills: - Proficient in Android app development. - Experience with integrating third-party APIs (specifically, food delivery services). - Knowledge in managing print jobs from an app to a thermal printer. - Familiarity with order aggregation and management.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/pcb-layout/multilayer-pcb-layout-design-for",
        "title": "Multilayer PCB Layout Design for a Zynq-based FPGA board",
        "salary": "Competitive compensation based on experience; Reference compensation: estimated 10.000-20.000 SEK",
        "company": "",
        "location": "",
        "skillset": "Altium Designer, Circuit Design, DDR3 (PCIe, board design/fpga), Electronics, PCB Layout",
        "date of posting": "Ended",
        "job_description": "We are developing a Zynq-based FPGA board based on ...and datasheets\n-PCB size and parameter constraints\n-List of design constraints for manufacturability and compliance\n\nWhat We’re Looking For:\n-Experience with designing multilayer impedance-tuned PCB layouts for FPGA-DDR3 boards\n-Excellent communication skills for collaboration and design reviews\n-Opportunity for future work if this initial project is successful\n-Portfolio with relevant previous jobs.\n\nBudget and Timeline:\n-Competitive compensation based on experience; Reference compensation: estimated 10.000-20.000 SEK\n-Estimated completion: 2 months, but flexible depending on conditions\n-Payments will be milestone-based, with reviews at key stages\n\nLooking forward to hearing from you and hoping for a fruitful ...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/game-development/unreal-engine-game-developer-38629356",
        "title": "Unreal Engine game developer",
        "salary": "$23 / hr",
        "company": "",
        "location": "",
        "skillset": "C++ Programming, Game Development, Unreal Engine",
        "date of posting": "Ended",
        "job_description": "...fast-paced, story-driven 2D action rogue-lite with RPG elements, set in a rich sci-fi/fantasy universe. We offer creative freedom and the opportunity to be a key part of this exciting journey from the ground up.\n\nYOUR ROLE:\n\nWe are looking for an Unreal Engine 5 Developer to take a leading role in the development of Hypocrisy. We are open to candidates at all levels - whether you’re an experienced senior developer ready to lead the project, or a mid-level or entry-level candidate eager to grow into a leadership role. This is an exciting opportunity for anyone passionate about game development and looking to make a major impact.\n\nYOU WILL:\n\n- Lead the development of core game mechanics using Unreal Engine 5.\n- Collaborate closely with the design and art teams to implement ga...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/need-assistance-with-various-tasks",
        "title": "Need Assistance with Various Tasks",
        "salary": "$244",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Website Design",
        "date of posting": "Ended",
        "job_description": "I'm looking for freelancers to help with a variety of jobs. The exact nature of the tasks is not specified yet, but I'm open to proposals and suggestions.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/illustration/superhero-themed-poster-design-for",
        "title": "Superhero Themed A3 Poster Design for Class Delegate",
        "salary": "$90",
        "company": "",
        "location": "",
        "skillset": "Caricature & Cartoons, Graphic Design, Illustration, Poster Design, Print",
        "date of posting": "Ended",
        "job_description": "...haché\" day with plates of delicious fries and steaks for the students.\n\n2\\. La Décoration\n- Depict children decorating the school hallways and preparing a colorful room.\n\n3\\. La Récré\n- Show a baby-foot table and rackets for playing games in the school courtyard.\n\n4\\. Apprendre avec les Grands\nPresent a high-level athlete giving a talk to the students, to explain his jobs or just the picture of french well know athelte (like teddy riner)\nImportant Details:\n- I will provide you with a photo of my son to include on the poster.\n- You will also receive an (Bad :) example poster for inspiration.\n- I will share the URL of his school so you can use their logo or an image if it inspires you :\n\nThe style should be dy...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/amazon-web-services/devops-specialist-for-aws-lambda",
        "title": "DevOps Specialist for AWS Lambda Automation",
        "salary": "$10 / hr",
        "company": "",
        "location": "",
        "skillset": "Amazon S3, Amazon Web Services, AWS Lambda",
        "date of posting": "Ended",
        "job_description": "Looking to create AWS lambda via jenkins pipeline via seed Jobs\nIts using the groovy script .\nNeed to write seed Jobs and build script .\nShould be very good in doing this specific task .\nShoud be able to understand the complex jenkins pipeline .\nShould be willing to work on client environment remotely.",
        "experience_required": "4-6 years"
      },
      {
        "url": "https://www.freelancer.com/projects/audio-services/hiring-for-tamil-voice-artist",
        "title": "Hiring for Tamil Voice Artist",
        "salary": "$12 / hr",
        "company": "",
        "location": "",
        "skillset": "Audio Production, Audio Services, Tamil Translator, Voice Artist, Voice Talent",
        "date of posting": "Ended",
        "job_description": "Pocket FM - India's largest social audio platform with more than 3,00,000 users is looking to hire voice artists proficient in Tamil Language for Full time and Part time jobs.\n\nGenre: Entertainment/Fiction/Romance/Thriller/Horror\nSkills Required - Excellent Narration Skills\nFormat: Episodic\nTotal Audio Length : 5 hrs\nLanguage: Tamil\nThese will be episodic shows (5-10) to be created basis a script or a script idea.\nContract will be awarded only after the testing a Sample Audio.\nPay will be per hour of finished content produce by the artist.\nAll content will be an intellectual property of PocketFM.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/php/laravel-expert-needed-for-commission",
        "title": "Laravel Expert Needed for Commission System",
        "salary": "$50 / hr",
        "company": "",
        "location": "",
        "skillset": "Laravel, PHP, PostgreSQL, PostgreSQL Programming, Software Architecture",
        "date of posting": "Ended",
        "job_description": "I'm seeking a seasoned Laravel and PostgreSQL professional to develop a code that calculates commissions from a binary payment system. This involves direct sales commissions, team performance bonuses, and referral bonuses.\n\nKey Responsibilities:\n- Write code to calculate various types of commissions\n- Utilize sales transactions and team member performance metrics as data inputs\n- Ensure calculations are performed weekly\n\nIdeal Candidate:\n- Senior Laravel Engineer with extensive experience\n- Able to provide ID and photo for proof of identity\n- No ju...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/website-design/modern-commerce-site-for-forklifts",
        "title": "Modern E-Commerce Site for Forklifts",
        "salary": "$325",
        "company": "",
        "location": "",
        "skillset": "eCommerce, HTML, PHP, Website Design, WordPress",
        "date of posting": "Ended",
        "job_description": "...section, a Contact Us page, and a Finance plugin.\n\nNotes:\nThe domain is with crazy domains\nMy host is godaddy\n\nHOME – leave to you to make it look professional – I will get images soon\nABOUT US- Australian family owned Business – As a Engineering family background we have taken forklifts to the next level , making changes to a already good product to make it user friendly and adaptable to most jobs\nCONTACT US– form who have my contact information\nOUR RANGE – 4x4 SYM35 , SYM ALL TERRAIN both include low level container mast with side shift option fork positioners. There are 3 styles of forklifts with variable options to choose from which then depends on the price\nFINANCING - will be supplied tomorrow morning from finance team\n\nADDITIONAL REQUIREMENT:...",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/python/weekly-financial-ratios-download-from",
        "title": "Weekly Financial Ratios Download from Yahoo Finance",
        "salary": "$981",
        "company": "",
        "location": "",
        "skillset": "Data Processing, Excel, Python, Statistical Analysis, Statistics",
        "date of posting": "Ended",
        "job_description": "I'm looking for a skilled data scientist or programmer who can automate the process of downloading financial ratios from Yahoo Finance on a weekly basis.\n\n- Data Type: The project focuses specifically on Financial Ratios.\n- Time Period: The download should be set to weekly intervals.\n- Data Format: The financial ratios should be saved in Excel format.\n\nIdeal candidates for this project should have experience with data scraping and working with financial data. Proficiency in programming languages such as Python, along with knowledge of libraries like pandas and requests, would be beneficial.\n\nThis is kind of what i need, but the guys API is no longer available.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/research/commerce-virtual-assistant-for-ongoing-39063546",
        "title": "E-commerce Virtual Assistant for Ongoing Basis - 2",
        "salary": "$4 / hr",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Research, Virtual Assistant",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "Looking for Virtual Assistants who has the following skills: Good with excel, High attention to details, Is smart & fast in their work, Self learner & able to follow user guides, Meet deadlines, Proactive & willing to go the extra mile. Job Responsibility: Data Entry & basic admin tasks, Do some research jobs related to products and purchase, Online search for suppliers/ whole sellers/ manufacturer who can give quality products at a very competitive price.",
        "experience_required": "Freshers can also apply"
      },
      {
        "url": "https://www.freelancer.com/projects/python/machine-learning-analysis-the-data",
        "title": "Machine learning analysis the data",
        "salary": "$132",
        "company": "",
        "location": "",
        "skillset": "Data Mining, Machine Learning (ML), Python, Statistics",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "I'm a beginner in Machine Learning and I need a scholar in data science who can help me develop my skills and gain confidence. I am familiar with Python and I would like to focus on Machine Learning specifically. Key Responsibilities: I have data and need to do machine learning for the prediction for better service and improve the service for the customer. I need to the analysis the data using the machine learning.",
        "experience_required": "Beginner in Machine Learning"
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/data-entry-job-application-specialist",
        "title": "Data Entry & Job Application Specialist",
        "salary": "$119",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Research, Virtual Assistant, Web Search",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "Looking for a detail-oriented Filipino individual to assist with job applications and data entry. Key Responsibilities: Apply to jobs on various platforms on behalf of clients, including LinkedIn, modify resumes as needed to suit job applications, communicate with team members via Slack, attend bi-weekly meetings on Google Meet. Working Conditions: Minimum 4-hour work days, Monday to Saturday, Afternoon to evening commitments, time varies.",
        "experience_required": "Previous experience in data entry or job application assistance will be an asset"
      },
      {
        "url": "https://www.freelancer.com/projects/chatgpt/job-application-automation-agent",
        "title": "AI Job Application Automation Agent",
        "salary": "$143",
        "company": "",
        "location": "",
        "skillset": "ChatGPT, Database Administration, Python, Software Architecture, Zapier",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "I want to create an AI agent that automates my job application process. This personal project involves: Job scraping from multiple platforms: LinkedIn, Indeed, Glassdoor, reed, and monster. Resume matching: The AI should be able to match keywords in my resume with the skills required for the job. Applying for jobs: The AI will send my cover letter and resume to HR. Additionally, the AI should create a list of jobs in Google Sheets.",
        "experience_required": "Experience in AI development, specifically in creating job application bots"
      },
      {
        "url": "https://www.freelancer.com/projects/python/sql-python-assessment-creation",
        "title": "SQL & Python Assessment Creation",
        "salary": "$6 / hr",
        "company": "",
        "location": "",
        "skillset": "Database Administration, Database Programming, MySQL, Python, SQL",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "I'm looking for an experienced data professional who can help me prepare a set of complex SQL and Python analytics questions. The purpose of these questions is to assess the suitability of a candidate for a data-oriented role in our company. The questions should be diverse, covering various aspects of data manipulation and retrieval, with a few touching on database design and performance optimization.",
        "experience_required": "Experience in SQL and Python"
      },
      {
        "url": "https://www.freelancer.com/projects/content-writing/content-creation-optimization-for",
        "title": "Content Creation and Optimization for Science & Tech YouTube Channel",
        "salary": "$78",
        "company": "",
        "location": "",
        "skillset": "Article Writing, Content Writing, Copywriting, Creative Writing, Ghostwriting",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "I'm looking for a freelancer who can help me create engaging content for a new YouTube channel focused on educational tutorials and how-tos in the Ai field. Key Responsibilities: Develop engaging, informative, and accurate educational content, Optimize video content for maximum reach and engagement, Implement SEO strategies specific to YouTube.",
        "experience_required": "Proven experience in content creation for YouTube"
      },
      {
        "url": "https://www.freelancer.com/projects/graphic-design/science-project",
        "title": "Data Science Project",
        "salary": "$800",
        "company": "",
        "location": "",
        "skillset": "Graphic Design, Illustrator, Logo Design, Photoshop, Website Design",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "HI! We worked with you last year!!! We were so happy. It was a science project with myself (Kate!!!) and my friend Sand. Would be so grateful to work with you.",
        "experience_required": "N/A"
      },
      {
        "url": "https://www.freelancer.com/projects/iphone-app-development/high-school-college-education-app",
        "title": "High School & College Education App Development",
        "salary": "$540",
        "company": "",
        "location": "",
        "skillset": "Android, Graphic Design, iPad, iPhone, Mobile App Development",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "I'm looking for a proficient app developer to assist in creating an educational application focused on student learning and practice for high school and college students. The app will cover a broad range of subjects, encompassing math, science, reading and writing, among others.",
        "experience_required": "Extensive experience in app development, particularly in the education sector"
      },
      {
        "url": "https://www.freelancer.com/projects/research-writing/patient-monitoring-dsr-protocol",
        "title": "Patient Monitoring & DSR Protocol Literature Review",
        "salary": "$79",
        "company": "",
        "location": "",
        "skillset": "Academic Writing, Article Writing, Network Administration, Research Writing, Technical Writing",
        "date of posting": "2025-02-06T16:58:59.356Z",
        "job_description": "A list of all 50 references used in the literature review (in APA or IEEE format). A plagiarism report (less than 10%). An AI report (=0).",
        "experience_required": "Strong background in academic writing, Wireless Sensor Networks (WSN, routing protocols, and healthcare automation"
      },
      {
        "url": "https://www.freelancer.com/projects/telemarketing/sales-closer-needed-personal-development",
        "title": "Sales Closer Needed in Personal Development.",
        "salary": "$186",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm seeking a sales closer in the personal development niche. Experience with LinkedIn as a lead generation platform. Ability to ensure lead commitment to calls. The Leads must be ready to take action, the Leads need to know why they are on the call, for a High Ticket Course in Personal Development. Must have excellent control over the English language, must be able to speak and type fluent English. Freelancer ideally from the States, Canada, or UK. The goal is to effectively book these Warm Leads into our calendar for our Sales Closer to seal the deal. The primary objective of this campaign is to boost our sales. Therefore, a successful candidate will have a track record of converting leads into sales meetings, and ultimately, sales.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/leads/lead-generation-sales-closing-for",
        "title": "Lead Generation & Sales Closing for Course.",
        "salary": "$196",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm looking for a freelancer to help with lead generation and sales closing for a course. The student needs to be interested in this niche, the niche for Personal Development, so as the student goes through this course, they are willing to invest, willing to take action to see results from the Course. The Sales Closer will sell this Course on Thinkific for £3K asap.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/articles/journal-article-writer-needed",
        "title": "Journal Article Writer Needed",
        "salary": "$18 / hr",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm looking for a skilled writer to help pen a journal article over 5,000 words. The subject area is not specifically defined but it falls under general academic writing. Ideal Skills: Academic writing, Research, Literature review, Science, Technology, Literature. Experience: Writing for journals, 5,000+ word articles, Proposing theories or models. I am open to proposals that suggest a specific subject area or field. The primary objective of the article is also flexible. It could be to present new research findings, to review existing literature, or to propose a new theory or model. Your creativity and expertise will be key in making this article impactful.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/legal/join-legal-shield-team",
        "title": "Join My Legal Shield Team!",
        "salary": "$288",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm seeking motivated individuals to join my LegalShield team in the USA and Canada. This flexible opportunity allows you to earn extra income while helping others access affordable legal protection. Key Responsibilities: Promote and share LegalShield's legal and identity theft protection services. Help families and businesses gain access to essential legal services. What I Offer: Full training provided, no experience necessary. Flexible work hours, allowing you to work from anywhere. Potential to earn commissions and bonuses. Ideal Team Member: Motivated to earn extra income. Passionate about providing affordable legal help to others. Comfortable using instant messaging apps for team communication.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/autocad/construction-cost-estimator-needed",
        "title": "Construction Cost Estimator Needed",
        "salary": "$997",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "2 hours left",
        "job_description": "I'm in need of an experienced construction cost estimator to evaluate the cost-effectiveness or profitability of the project. Qualifications: Bachelor’s degree in engineering, construction science, or a related field. Proven experience as a cost estimator or in a similar role, particularly with Aramco projects. Strong analytical skills and attention to detail. Ideal skills for the job include proficiency in Microsoft Project, a solid understanding of material costs, and experience in tracking project costs.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/php/test-ontario-online-practice-test",
        "title": "G1 Test Ontario - Online Practice Test Site",
        "salary": "$336",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm seeking a web developer to create an online practice test platform for the G1 Test in Ontario. The site should offer practice tests similar to those provided by competitors in terms of user interface and experience. Key Features: Online practice tests: The main focus of the site is to provide comprehensive, accessible, and user-friendly practice tests for users preparing for the G1 Test. Progress tracking: Users should be able to track their progress over time, with the system recording their performance on each test. Question explanations: After each test, users should have access to detailed explanations for each question, helping them understand their mistakes and learn more effectively.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/php/tech-platform-website-development",
        "title": "HR-Tech Platform Website Development",
        "salary": "$273",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I'm seeking a developer to create a comprehensive HR-Tech platform that includes features for job posting, application tracking, and user management. The platform should have a user-friendly interface and robust backend capabilities. Key Features: User Profiles and Reviews, Service Provider Profiles, Admin Control Panel, Technical Requirements including Frontend and Backend technologies.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/javascript/job-portal-web-app-full",
        "title": "Job Portal Web App Full Stack Development",
        "salary": "$441",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "The app will need to have both a robust backend, utilizing AWS, and a user-friendly frontend. We have an existing frontend which currently runs on NextJS application. We need to develop the backend. Core Features: Job Posting and Searching, Automated Matching of Jobs and Candidates, Advanced Filtering Options, Email Notifications for Job Alerts.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/presentations/online-presenter-39069776",
        "title": "Online Presenter",
        "salary": "$265",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I am looking for a person with good communication skills to conduct online presentations for candidates.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/internet-marketing/engage-grow-online-contest-39069736",
        "title": "Engage & Grow Online Contest -- 2",
        "salary": "$112",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "6 days left",
        "job_description": "I need assistance with a digital marketing project that focuses on creating a buzz around an online voting contest. The contest is crucial for our brand as it aims to increase user engagement while simultaneously expanding our email subscriber base. Key Objectives: Enhance user engagement for the contest, Boost email list with new user registrations for nominations.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/data-entry-job-application-specialist",
        "title": "Data Entry & Job Application Specialist",
        "salary": "$100 per month",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Research, Virtual Assistant, Web Search",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "...detail-oriented Filipino individual to assist with job applications and data entry. Key Responsibilities: - Apply to jobs on various platforms on behalf of clients, including LinkedIn, etc. - Modify resumes as needed to suit job applications - Communicate with team members via Slack - Attend bi-weekly meetings on Google Meet. Working Conditions: - Minimum 4-hour work days, Monday to Saturday - Afternoon to evening commitments, time varies. Ideal Skills: - Strong attention to detail, ensuring every application and resume modification is precise - Familiarity with job sites, particularly LinkedIn - Excellent communication skills for team collaboration - Previous experience in data entry or job application assistance will be an asset.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/looking-for-based-professionals",
        "title": "We’re looking for US-based professionals to collaborate with us on an exciting LinkedIn-related project.",
        "salary": "$500 per successful job secured",
        "company": "",
        "location": "",
        "skillset": "Account Management, Communications, Customer Service, Customer Support, Data Entry",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "Exciting Remote Opportunity for US-Based Professionals! Earnings: - Fixed monthly payment: $500 per successful job secured using your profile (e.g., 2 jobs = $1,000/month it can increase up to $2,000/month). Role Overview: We help optimize and apply for relevant US-based job opportunities on your behalf. Our team handles the interview process and fulfills project requirements under the acquired roles. No personal device access is required—just a separate computer with a US-based location. Your LinkedIn account must be actively maintained to meet professional standards. Requirements: - Active LinkedIn profile (2+ years old) - Age 28+ years old - US Citizen with access to a separate computer/laptop.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/leads/cold-calling-list-for-sector",
        "title": "Cold Calling List for IT Sector",
        "salary": "$380",
        "company": "",
        "location": "",
        "skillset": "Data Mining, Leads, Market Research, Research, Sales",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "Freelancer with IT gen lead. Ideal skills for this project include: - Data mining - Lead generation - Market research. Experience in the IT sector is a plus.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/freelancer-for-data-extraction-from",
        "title": "Freelancer for Data Extraction from internet",
        "salary": "$18 / hr",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Data Mining, Excel, Web Scraping, Web Search",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "I need a skilled freelancer who can efficiently extract social media content from various sources including websites, social media profiles, and directories or databases. The extracted data should be delivered in Excel/CSV format. Ideal Skills and Experience: - Proficiency in data extraction and mining - Familiarity with social media platforms - Experience with web scraping - Ability to deliver data in specified formats.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/software-architecture/telegram-crypto-mining-game-bot",
        "title": "Telegram Crypto Mining Game Bot Development",
        "salary": "$239",
        "company": "",
        "location": "",
        "skillset": "Android, C Programming, Java, Software Architecture, Web Development",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "I am looking for a developer to create a Telegram-based mining game bot integrated with Toncoin cryptocurrency payments. Key Features: - The game will operate on a Proof of Stake (PoS) model. - Essential crypto functionalities include: - Payment processing - Wallet integration - Conversion rates tracking. Ideal Skills: - Extensive experience in bot development, particularly for Telegram. - In-depth understanding of both gaming and crypto mechanics. - Proficient in Toncoin integration and PoS framework. - Knowledge of secure payment processing and wallet integration.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/facebook-marketing/social-media-manager-for-luxury-39059149",
        "title": "Social Media Manager for Luxury Yacht Listings",
        "salary": "$15 - $25 / hr",
        "company": "",
        "location": "",
        "skillset": "Facebook Marketing, Google Plus, Pinterest, Social Media Marketing, Twitter",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "...and I'm looking for a competent and creative social media manager who can edit and produce videos for our high-end yacht listings on Instagram, Facebook, YouTube and our company website. I will provide raw content and details about each listing. Your responsibilities will include: - Editing the videos to fit a 'luxurious and elegant' theme. - Posting the videos on various social media sites. - Mining these platforms for appropriate tags and posts, and connecting with related pages and sites to generate qualified leads for our client's boats. Your understanding of luxurious lifestyles, attention to detail, and experience in social media management and video production will be crucial for the success of this project. The goal is to present our listings in an appealing manner.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/market-research/contact-information-data-mining",
        "title": "Contact Information Data Mining",
        "salary": "$14",
        "company": "",
        "location": "",
        "skillset": "Data Mining, Internet Research, Market Research, Research, Web Search",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "I'm seeking an adept data miner who can creatively gather contact information of potential customers, specifically in Australia. The methods can be diverse - from web searches to international phone calls. Around 10 key entries are required. Key Responsibilities: - Use innovative techniques to source contact information - Primarily target potential customers - Focus on the Australia region. Ideal Skills: - Proficiency in data mining and web search - Excellent communication skills for potential international calls - Creativity in finding and sourcing data. Experience: - Prior experience in market research or data mining is preferred.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/java/commerce-product-info-aggregator-backend",
        "title": "E-commerce Product Info Aggregator Backend -- 2",
        "salary": "$442",
        "company": "",
        "location": "",
        "skillset": "Java, MySQL, NoSQL Couch & Mongo, Python, Web Scraping",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "...information from leading e-commerce platforms in India - specifically Amazon India, Flipkart, and Myntra. The backend service should collect a variety of data, including product details, pricing information, and customer reviews. Key requirements include: - Expertise in backend development and SQL databases - Experience with data aggregation from e-commerce platforms - Understanding of product details, pricing information, and customer reviews - Ability to create a reliable and efficient service - Proficiency in integrating APIs from Amazon, Flipkart, and Myntra. - Experience with scheduling and automating data collection jobs. - Understanding of data security practices to protect sensitive information. - Experience with deploying backend services to production environments.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/linkedin-indeed-job-posting-expert",
        "title": "LinkedIn & Indeed Job Posting Expert",
        "salary": "$19",
        "company": "",
        "location": "",
        "skillset": "Data Entry, Facebook Marketing, Internet Marketing, Social Media Marketing, Virtual Assistant",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "...variety of job roles, including entry-level positions, mid-level positions, and senior-level positions, as well as C-Level, Director Level, Head Level, SVP Level, and VP Level jobs. Ideal Skills and Experience: - Proven experience with LinkedIn and Indeed job posting - Access to LinkedIn Premium Recruiter Lite - Ability to optimize job postings for visibility and reach - Strong understanding of recruitment for various job levels - Excellent communication skills. The job postings will be tailored for the United States industry. You will be responsible for posting unlimited job roles. The freelancer is expected to post jobs daily. Metrics and reports on job posting performance are not required. Job postings will be primarily for the every industry. Please assist with crafting effective job postings.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/website-design/wordpress-website-development-for-39057621",
        "title": "WordPress Website Development for TradesmenLeads",
        "salary": "$167",
        "company": "",
        "location": "",
        "skillset": "Website Design, WordPress",
        "date of posting": "2025-02-06T16:58:59.501Z",
        "job_description": "...don’t mess about. We get your phone ringing with real, high-quality leads from homeowners who need your services right now. No fluff, no BS—just solid jobs from people ready to pay. We’ve been in the game for over a decade, helping roofers, driveway installers, landscapers, and all types of tradesmen grow their businesses without wasting cash on useless ads. Why Work With Us? - Exclusive Leads – No sharing. The job’s yours or no one’s. - Straightforward Pricing – No contracts, no hidden fees—just leads that make you money. - Real Results, No Time Wasting – We know what works, and we cut out the fluff. You focus on the work. We’ll bring you the jobs. Let’s get started.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/local-area-networking/international-job-seeker-visa-expert",
        "title": "International Job Seeker & Visa Expert",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm in search of a professional who specializes in connecting international job seekers with companies that offer visa sponsorship. This professional should be well-versed in labor market trends, particularly in countries experiencing labor shortages, and can guide me through the entire process. Key Requirements: - Expertise in the Healthcare industry - Knowledge of job markets in the United States, Canada, Australia, United Kingdom, New Zealand, and Europe - Skills in job matching with companies - Guidance on necessary documents - Assistance with the visa sponsorship process",
        "experience_required": "Expertise in the Healthcare industry"
      },
      {
        "url": "https://www.freelancer.com/projects/php/mid-level-software-devs-job",
        "title": "Mid-Level Software Devs Job Seekers Database",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm looking for a comprehensive database of 10,000 active job seekers with a focus on entry-level & mid-level Software Development skills. Requirements: - Job seekers should be looking for job in IT field. - Database should include first name, last name, email, and phone number. Please note, the job seekers must be currently seeking IT roles.",
        "experience_required": "Job seekers should be looking for job in IT field."
      },
      {
        "url": "https://www.freelancer.com/projects/data-processing/job-application-submissions-assistance",
        "title": "Job Application Submissions Assistance -- 2",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "Job Title: Submit Job Applications on Job portals using my Resume. Job Description: I am looking for a reliable freelancer to submit job applications on my behalf using my resume on various platforms, like Linkedin, Workday and Indeed. Your task will involve searching for relevant job postings that match my qualifications, and submitting my resume for each opportunity. Responsibilities: - Search for job postings on Linkedin, Glassdoor, Workday and Indeed that match my experience and skills. - Submit my resume to the job listings - Ensure each application is relevant to my background and experience. - Track and report the total number of applications submitted using MS Excel or Google Sheets",
        "experience_required": "Strong attention to detail"
      },
      {
        "url": "https://www.freelancer.com/projects/seo/linkedin-job-application-assistance",
        "title": "LinkedIn Job Application Assistance",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm seeking a professional to help me fill out online job applications on LinkedIn. The ideal freelancer would be able to assist with completing my profile information and optimizing keywords to increase my visibility and chances of getting noticed by potential employers. Skills and Experience: - Expertise in LinkedIn platform - Experience in job application processes - Excellent knowledge in SEO and keyword optimization - Strong understanding of professional profile requirements - Resume and cover letter writing skills are a plus",
        "experience_required": "Expertise in LinkedIn platform"
      },
      {
        "url": "https://www.freelancer.com/projects/linkedin/linkedin-profile-optimization-for-job",
        "title": "LinkedIn Profile Optimization for Job Seekers",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm seeking an expert to optimize my LinkedIn profile. The main objective is to attract recruiters. The ideal candidate should have a strong understanding of LinkedIn's algorithm and best practices for profile optimization. Prior experience in career consultancy or recruiting is a plus.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/php/job-portal-integration-ats",
        "title": "Job Portal Integration & ATS Implementation",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "We operate a job portal, built on PHP and SQL. Our goal is to extend our reach by linking job posts with prominent job websites like Indeed and LinkedIn, and possibly others like Monster Jobs, TimesJobs, etc. Key Requirements: - Real-time synchronization of job postings across platforms - Integration of an Application Tracking System (ATS) We already have accounts set up on both Indeed and LinkedIn. The ideal candidate for this project would be someone with substantial experience in job portal integration, preferably with knowledge of implementing an ATS. Please provide your most competitive quote.",
        "experience_required": "Substantial experience in job portal integration"
      },
      {
        "url": "https://www.freelancer.com/projects/php/dual-user-job-hiring-portfolio-39030300",
        "title": "Dual-User Job Hiring Portfolio Website -- 2",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "...to build an interactive job hiring portfolio website catering to both job seekers and employers. Key Features: - Both job seekers and employers should be able to sign up and create personal, undateable portfolios for future job offers. - Employers should primarily have access to view and search these portfolios. - Job seekers should be able to create and update their portfolios at their convenience. Ideal Skills: - Web development (preferably using a responsive framework such as Bootstrap or similar). - Experience in creating interactive, user-friendly interfaces. - Knowledge in implementing secure user sign-up and profile management systems. - Understanding of back-end development for managing and storing portfolio data.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/medical-writing/freelance-medical-coder-job-posting",
        "title": "Freelance Medical Coder Job Posting",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "**Freelance Medical Coder Job Posting** **Title:** Freelance Medical Coder for USA-based Projects **Description:** We are seeking a skilled and detail-oriented Freelance Medical Coder to support our medical documentation and coding projects for USA-based healthcare clients. The ideal candidate will have extensive experience with medical coding standards and EHR systems, ensuring accurate and compliant coding practices. **Responsibilities:** - Review and analyze patient medical records to assign appropriate diagnostic (ICD-10-CM), procedural (CPT), and HCPCS codes. - Ensure compliance with legal regulations, HIPAA standards, and healthcare reimbursement guidelines. - Work collaboratively with healthcare providers and billing teams to resolve coding issues.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/data-entry/full-time-job-posting-across-39029596",
        "title": "Full-time Job Posting Across All Boards -- 2",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I need a freelancer to post a full-time job vacancy on all major job boards including, but not limited to, LinkedIn, Indeed and Glassdoor. Ideal Skills: - Proficient in using multiple job boards - Excellent understanding of job posting protocols - Good communication skills - Attention to detail",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/social-media-marketing/job-portal-promotion-expert-needed-39028938",
        "title": "Job Portal Promotion Expert Needed -- 2",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm looking for a seasoned freelancer who specializes in promoting job portal platforms. Key Responsibilities: - Drive user engagement and increase weekly sign-ups to our platform. - Target: 300-350 candidates signing up each week. Ideal Skills and Experience: - Proven experience in similar projects. - Successful track record in implementing strategies to grow candidate registration and engagement.",
        "experience_required": "Proven experience in similar projects"
      },
      {
        "url": "https://www.freelancer.com/projects/english-us-translator/zoom-interviewer-for-job-applicants",
        "title": "Zoom Interviewer for Job Applicants",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm looking for a professional who can conduct Zoom interviews on my behalf. I will supply the questions, and you will interview job applicants. The candidates will primarily be from the travel industry.",
        "experience_required": ""
      },
      {
        "url": "https://www.freelancer.com/projects/resumes/ats-creation-for-gcc-job",
        "title": "ATS CV Creation for GCC Job Market",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm seeking a professional CV writer with a solid understanding of the Gulf Cooperation Council (GCC) job market, particularly Saudi Arabia. The CV should be tailored for a mid-level professional and optimized for Applicant Tracking Systems (ATS). Key Requirements: - Inclusion of a compelling professional summary at the beginning - Targeting of mid-level job roles - Optimization for ATS to enhance visibility",
        "experience_required": "Expertise in CV writing and design"
      },
      {
        "url": "https://www.freelancer.com/projects/telemarketing/cold-calling-for-job-candidate-39021742",
        "title": "Cold Calling for Job Candidate Appointments",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "I'm seeking a skilled cold caller to help set appointments with prospective job candidates for mid-level positions within the manufacturing and support sectors. Your primary role will be reaching out to potential candidates, gauging their interest, and scheduling appointments for further discussions. Ideal Skills and Experience: - Proven experience in cold calling and telesales - Excellent communication and interpersonal skills - Background knowledge or experience in the manufacturing and support sectors - Ability to engage with mid-level professionals - Experience in HR or recruitment-related cold calling is a plus.",
        "experience_required": "Proven experience in cold calling and telesales"
      },
      {
        "url": "https://www.freelancer.com/projects/mobile-app-development/comprehensive-job-portal-development",
        "title": "Comprehensive Job Portal Development",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "",
        "date of posting": "Ended",
        "job_description": "FEATURES FOR JOB PORTAL (FRONT END & BACK END) FRONT END PAGES Home: Introduction to the job portal, & indexing of internal pages. Job Search: A page where job seekers can search for jobs through filters like location, job title, job keywords industry, etc. Job Details: A page that displays detailed information about all jobs which have been posted from back end by all the companies. Job Application: A page where job seekers can apply for a job by uploading their resume and cover letter. Employers Directory: A page that lists all registered employers on the platform & from same page employer can create a profile of them. Job Posting: A page where employers can post new job openings. About Us: A page that provides information about the job portal.",
        "experience_required": ""
      }
    ]
  }
]