[
  {
    "jobs": [
      {
        "url": "https://www.naukri.com/job-listings-inviting-applications-for-gen-ai-solution-architect-genpact-bangalore-rural-10-to-14-years-300524008407",
        "title": "Gen AI Solution Architect",
        "salary": "",
        "company": "Genpact",
        "location": "Bangalore Rural",
        "skillset": "Gen AI, Generative AI, Data-Tech-AI, Solution Architect",
        "date of posting": "2025-02-06T15:03:38.256Z",
        "job_description": "With a startup spirit and 115,000+ curious and courageous minds, we have the expertise to go deep with the worlds biggest brands—and we have fun doing it. We dream in digital, dare in reality, and reinvent the ways companies work to make an impact far bigger than just our bottom line. We’re harnessing the power of technology and humanity to create meaningful transformation that moves us forward in our pursuit of a world that works better for people. Now, we’re calling upon the thinkers and doers, those with a natural curiosity and a hunger to keep learning, keep growing., People who thrive on fearlessly experimenting, seizing opportunities, and pushing boundaries to turn our vision into reality. And as you help us create a better world, we will help you build your own intellectual firepower.\n\nWelcome to the relentless pursuit of better.\n\nInviting applications for the role of Data-Tech-AI Consultant. Your responsibilities in this role include being part of a team supporting our Transformation Partners to lead and execute strategic projects, with leading companies, to drive transformation through our Digital, Analytics and Consultative capabilities with our industry leading methodologies. Responsibilities include industry knowledge and experience in the hi-tech software industry, preferably with one or more sub-sectors, domain/depth of skills in software product development lifecycle, software services and process transformation areas, and more.",
        "experience_required": "10 to 14 years"
      },
      {
        "url": "https://www.foundit.in/job/hcl-is-hiring-for-aiml-technical-architect-hcl-technologies-limited-noida-33935126",
        "title": "AIML Technical Architect",
        "salary": "",
        "company": "HCL Technologies Limited",
        "location": "Noida",
        "skillset": "AIML, Tensorflow, Cloud Computing, NLP, Big Data, Neural Networks, Data Analytics, Python, Deep Learning, Computer Vision",
        "date of posting": "2025-02-06",
        "job_description": "Research, develop, optimize and productize for artificial intelligence and machine learning applications. In-depth knowledge of machine learning, text extraction and image processing techniques & Natural Language Processing. Experience in developing machine learning, text extraction and image processing algorithms, and optimizing the existing algorithms. Coding experience in Python. Experience in products like Tensorflow, CUDA toolkit, CuDNN, Theano, Caffe, Torch, OpenCV or similar tools. Experience working with Cloud Services AWS, Azure etc. Takes ownership of self-professional development. The desired candidate should be a quick thinker and should have a track record of high performance product development. Additionally, the candidate should be innovative, dedicated and result oriented. Research experience is preferred. Strong background in Math specially in statistics, modelling and matrices.",
        "experience_required": "9-14 Years"
      },
      {
        "url": "https://www.foundit.in/job/machine-learning-architect-antal-international-network-chennai-33934915",
        "title": "Machine Learning Architect",
        "salary": "",
        "company": "Antal International Network",
        "location": "Chennai, India",
        "skillset": "LangChain, LLaMA, Mistral, OpenAI APIs, SpaCy, AI model optimization, Cloud deployment, Zephyr, Deep Learning, Tensorflow, Pytorch, MLops, Python",
        "date of posting": "2025-02-05",
        "job_description": "**Key Responsibilities**\n- **ML Solution Architecture:** Design and develop scalable AI/ML architectures with a focus on Deep Learning, Large Language Models (LLMs), and Natural Language Processing (NLP).\n- **Model Optimization:** Enhance model efficiency, reduce latency, and optimize memory usage for real-time document processing.\n- **ML Infrastructure Development:** Build and manage MLOps pipelines for experimentation, A/B testing, and deployment.\n- **LLM Pipeline Development:** Develop and optimize pipelines using LangChain, LlamaIndex, and other AI frameworks.\n- **AI Strategy & Solutioning:** Collaborate with cross-functional teams to align AI models with business objectives.\n- **Automation & Scalability:** Create scalable and automated AI workflows for intelligent document processing.\n- **Research & Innovation:** Stay updated on the latest AI advancements and integrate cutting-edge ML techniques into the platform.\n\n**Required Qualifications**\n- **Experience:** 8+ years in AI/ML within a software or product company.\n- **Expertise:** Strong background in Deep Learning, Large Language Models (LLMs), and NLP (e.g., BERT, GPT, RoBERTa).\n- **Programming:** Proficiency in Python with hands-on experience in ML frameworks like PyTorch, TensorFlow, LangChain, and SpaCy.\n- **LLM Experience:** Practical experience with LLaMA, Zephyr, Mistral, and OpenAI APIs.\n- **MLOps & Deployment:** Expertise in MLOps, cloud deployment, and AI model optimization.\n- **Problem-Solving:** Strong analytical skills and a product-first mindset.",
        "experience_required": "8-10 Years"
      },
      {
        "url": "https://www.foundit.in/job/sr-cloud-ai-architect-presales-minfy-hyderabad-secunderabad-telangana-33933902",
        "title": "Sr. Cloud AI Architect - Presales",
        "salary": "",
        "company": "Minfy",
        "location": "Hyderabad, India",
        "skillset": "Proficiency in cloud platforms (e.g., AWS, Azure, GCP) and AI/ML frameworks (e.g., TensorFlow, PyTorch, Scikit-learn).",
        "date of posting": "2025-02-05",
        "job_description": "We are seeking a seasoned Sr. Cloud AI Architect to join our pre-sales team, specializing in designing and delivering advanced AI solutions on cloud platforms. This hands-on role focuses on driving opportunity conversion and establishing thought leadership in the AI domain. The ideal candidate will work closely with sales teams, clients, and internal stakeholders to architect cutting-edge AI solutions that align with business goals. Success in this role will be measured by key performance indicators (KPIs) such as conversion rates, deal velocity, and client satisfaction.",
        "experience_required": "8-10 Years"
      },
      {
        "url": "https://www.foundit.in/job/solution-architect-artificial-intelligence-vice-president-state-street-corporation-hyderabad-secunderabad-telangana-33934504",
        "title": "Solution Architect Artificial Intelligence - Vice President",
        "salary": "",
        "company": "State Street Corporation",
        "location": "Hyderabad, India",
        "skillset": "Full-stack development, Large language models, Machine learning services, Databricks, Azure, Azure Machine Learning, Python, AWS",
        "date of posting": "2025-02-06",
        "job_description": "We are in search of an experienced Solution Architect with a robust background in designing and implementing full stack applications driven by AI capabilities. They are expected to develop architectural designs, and implement AI projects using cloud technologies. They need to take care of the entire lifecycle of a project starting from design, implementation and deployment. Their role also involves selecting appropriate cloud components and optimizing performance. The perfect fit for this role would be someone who has previously architected solutions, fine-tuned performance, amalgamated with pre-existing systems, and transitioned data science models into production. In the role of AI Solution Architect, your duties will encompass the following: Use your full stack development experience to Architect, implement and deploy AI solutions, with an emphasis on accuracy, efficiency, and scalability. Work in tandem with data scientists and software engineers to conceptualize and construct data pipelines, preprocessing utilities, feature engineering and inferencing systems. Collaborate with stakeholders to understand business needs and identify opportunities where AI can provide value and address challenges. Make efficient use of cloud platforms, notably Azure and AWS, for the deployment and scaling of AI and ML models. Integrate AI and ML models seamlessly into existing software frameworks and infrastructure. Stay abreast with the latest breakthroughs in design pattern for AI and ML applications. Engage effectively with diverse teams to gather requirements and translate them into technical strategies. Strong hands-on skills to mentor and offer technical guidance and required assistance to team. Core/Must have skills: Bachelors or Master's in Computer Science, Computer Information Systems Engineering or related engineering disciplines. Utilize your expertise in Python and full-stack development to build and deploy high-quality AI applications. Hands-on experience with Azure or AWS cloud platforms, including machine learning services and tools. Provide technical guidance and mentorship to team members, fostering a culture of continuous learning and improvement. Excellent communication and collaboration skills to work effectively with cross-functional teams. Good to have skills: Stay up-to-date with the latest industry trends and technologies, and proactively propose innovative solutions to enhance our offerings. Familiarity with Databricks or Azure Machine Learning or equivalent in AWS for scalable data processing and deployment of AI solutions. Familiarity with large language models, such as OpenAI or equivalent models, for advanced natural language processing tasks. Work Schedule: On-premise. Keywords (If any): Solution Architect, AI Architect, Senior ML Engineer. Why this role is important to us: Our technology function, Global Technology Services (GTS), is vital to State Street and is the key enabler for our business to deliver data and insights to our clients. We're driving the company's digital transformation and expanding business capabilities using industry best practices and advanced technologies such as cloud, artificial intelligence and robotics process automation. We offer a collaborative environment where technology skills and innovation are valued in a global organization. We're looking for top technical talent to join our team and deliver creative technology solutions that help us become an end-to-end, next-generation financial services company. Join us if you want to grow your technical skills, solve real problems and make your mark on our industry. About State Street: State Street is one of the largest custodian banks, asset managers and asset intelligence companies in the world. From technology to product innovation, we're making our mark on the financial services industry. For more than two centuries, we've been helping our clients safeguard and steward the investments of millions of people. We provide investment servicing, data & analytics, investment research & trading and investment management to institutional clients. Work, Live and Grow: We make all efforts to create a great work environment. Our benefits packages are competitive and comprehensive. Details vary by location, but you may expect generous medical care, insurance and savings plans, among other perks. You'll have access to flexible Work Programs to help you match your needs. And our wealth of development programs and educational support will help you reach your full potential. Inclusion, Diversity and Social Responsibility: We truly believe our employees diverse backgrounds, experiences and perspectives are a powerful contributor to creating an inclusive environment where everyone can thrive and reach their maximum potential while adding value to both our organization and our clients. We warmly welcome candidates of diverse origin, background, ability, age, sexual orientation, gender identity and personality. Another fundamental value at State Street is active engagement with our communities around the world, both as a partner and a leader. You will have tools to help balance your professional and personal life, paid volunteer days, matching gift programs and access to employee networks that help you stay connected to what matters to you. State Street is an equal opportunity and affirmative action employer. Discover more at StateStreet.com/careers.",
        "experience_required": "Fresher"
      }
    ]
  }
]