[
  {
    "jobs": [
      {
        "title": "Senior Data Scientist/ Data Scientist",
        "salary": "Not disclosed",
        "company": "Fractal Analytics",
        "location": "Mumbai, Pune, Chennai, Gurugram, Bengaluru",
        "job_description": "Experience with programming languages such as Python, R, Spark. Strong understanding of RCA, Software design, Version control, Coding, Machine learning, Data structures, Project delivery, Monitoring.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist (ML Ops)",
        "salary": "Not disclosed",
        "company": "Hoffmann-La Roche",
        "location": "Hyderabad",
        "job_description": "Continuously improve eventing code logic for better results. Who You Are. You hold a ... Pharma, Agile, Healthcare, HTML, Econometrics, Forecasting, Analytics, Monitoring.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Senior Data Scientist (GenAI)",
        "salary": "Not disclosed",
        "company": "Roche Diagnostics",
        "location": "Hyderabad",
        "job_description": "Build toolsets and re-usable components for our future projects and ideas and automate ... Text mining, data science, Machine learning, Agile, Healthcare, Project delivery, Business solutions, Econometrics.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "London Stock Exchange Group (LSEG)",
        "location": "Bengaluru",
        "job_description": "Design and develop new methodologies, quantitative models, analysis, and commentary (Data analysis, Analytical, Machine learning, Healthcare, Data processing, HTML, Analytics, Recruitment).",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Valiance Solutions",
        "location": "Bengaluru",
        "job_description": "Valiance Solutions is looking for Senior Data Scientist to join our dynamic team and em... Senior Data Scientist - 001.",
        "experience_required": "5-7 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Terawe Technologies",
        "location": "Bengaluru",
        "job_description": "Educational Qualification:- Bachelor of Technology in Computer Science or related field... Data Science, Communicational Skills, Technical Leadership, Tensorflow, Pandas, Architectural Patterns, Deep Learning, Scikit-Learn.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "25-30 Lacs PA",
        "company": "Eastvantage",
        "location": "Bengaluru",
        "job_description": "Advanced Machine Learning Expertise: Strong proficiency in building and deploying machine... Xgboost, Aws Sagemaker, Data Visualization, Machine Learning, Deep Learning, Data Science, Glue, AWS.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Lowes Services India Private limited",
        "location": "Bengaluru",
        "job_description": "Proven track record of designing and analyzing large-scale A / B tests and experiments ... Data analysis, Machine learning, Agile, Continuous improvement, Monitoring, Analytics, Product marketing, SQL.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Data Scientist/Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Lightmetrics",
        "location": "Bengaluru",
        "job_description": "Communicate the findings clearly through good visualizations as well as written reports... Product management, Computer vision, Machine learning, Web development, Data structures, Telematics, Analytics, Logistics.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "GEN AI - Senior Data Scientist- GenAI",
        "salary": "20-25 Lacs PA",
        "company": "Onesoft Technologies",
        "location": "Chennai, Bengaluru",
        "job_description": "Requirements: 7 to10 Yrs Relevant Experience Machine Learning (ML) & Deep Learning. So... Artificial Intelligence, Django, Machine Learning, Deep Learning, Tensorflow, Pytorch, Rnn, Lstm.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Senior Data Scientist (GenAI)",
        "salary": "Not disclosed",
        "company": "Hoffmann-La Roche",
        "location": "Hyderabad",
        "job_description": "Build toolsets and re-usable components for our future projects and ideas and automate ... Text mining, data science, Machine learning, Agile, Healthcare, Project delivery, Business solutions, Econometrics.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Providence College Of Engineering",
        "location": "Hyderabad",
        "job_description": "Experience working with Gen-AI, expertise in fine-tuning transformer-based models / LLM... Mining, SAS, Production support, Coding, Talent acquisition, Analytical, Healthcare, Data processing.",
        "experience_required": "5-9 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Softweb Solutions",
        "location": "Ahmedabad",
        "job_description": "The ideal candidate will have a proven track record in designing and implementing advan... deep learning, Data analysis, Analytical, Machine learning, Algorithm development, Presales, JPEG, Python.",
        "experience_required": "6-11 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "18-33 Lacs PA",
        "company": "17 LIVE INC.",
        "location": "Remote",
        "job_description": "It’s about people, behavior, and culture. You instinctively connect the dots between data... Data Analytics, Recommender Systems, Insights, Bayesian methods, Statistical Modeling, AI-driven content moderation, Ab Testing, data insights.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Go Digital Technology Consulting",
        "location": "Hybrid - Pune, Mumbai (All Areas)",
        "job_description": "Job Title: Sr. Data Scientist Location: Mumbai / Pune Job Type: Full-time Experience: 4-... Senior Data Scientist, Computer Vision, Pytorch, Pandas, Machine Learning, Numpy, Python, Senior.",
        "experience_required": "4-7 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Hilabs",
        "location": "Pune",
        "job_description": "The individuals who will join the new Evolutionary Platform team should be continually ... System architecture, Maven, MySQL, Debugging, Agile, h1b, Oracle, Apache.",
        "experience_required": "5-7 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "London Stock Exchange Group (LSEG)",
        "location": "Bengaluru",
        "job_description": "Design and develop new methodologies, quantitative models, analysis, and commentary. Skills required include Data analysis, Analytical, Machine learning, Healthcare, Data processing, HTML, Analytics, Recruitment.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Valiance Solutions",
        "location": "Bengaluru",
        "job_description": "Valiance Solutions is looking for Senior Data Scientist to join our dynamic team.",
        "experience_required": "5-7 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Terawe Technologies",
        "location": "Bengaluru",
        "job_description": "Educational Qualification: Bachelor of Technology in Computer Science or related field. Skills required include Data Science, Communicational Skills, Technical Leadership, Tensorflow, Pandas, Architectural Patterns, Deep Learning, Scikit-Learn.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "25-30 Lacs PA",
        "company": "Eastvantage",
        "location": "Remote",
        "job_description": "Advanced Machine Learning Expertise: Strong proficiency in building and deploying machine learning models.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Lowes Services India Private limited",
        "location": "Bengaluru",
        "job_description": "Proven track record of designing and analyzing large-scale A/B tests and experiments.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Data Scientist/Senior Data Scientist",
        "salary": "Not disclosed",
        "company": "Lightmetrics",
        "location": "Bengaluru",
        "job_description": "Communicate the findings clearly through good visualizations as well as written reports.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Senior Data Scientist, Amazon Pay",
        "salary": "Not disclosed",
        "company": "Amazon",
        "location": "Bengaluru",
        "job_description": "Experience 4+ years of data scientist experience. Experience with statistical models.",
        "experience_required": "8-12 Yrs"
      },
      {
        "title": "Senior Data Scientist- CV",
        "salary": "Not disclosed",
        "company": "Digit Insurance",
        "location": "Bengaluru",
        "job_description": "Experience in building backend python applications. Strong experience in building Microservices.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Sr. Data Scientist - ML Ops",
        "salary": "Not disclosed",
        "company": "Visa",
        "location": "Bengaluru",
        "job_description": "4 years of work experience with a Bachelor’s Degree or at least 2 years of work experience with a Master’s Degree.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Senior Data Scientist (Audiences & Insights)",
        "salary": "50-80 Lacs PA",
        "company": "Verve",
        "location": "Bengaluru",
        "job_description": "A postgraduate degree in a relevant quantitative field (e.g 5+ years experience working in data science).",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Senior Data Scientist-Computer Vision",
        "salary": "15-30 Lacs P.A.",
        "company": "Adani Group",
        "location": "Kolkata",
        "job_description": "We are seeking a dynamic and innovative Image Scientist with 8-13 years of experience in the Data Science and AI industry to join our team in Kolkata, West Bengal. As an Image Scientist, you will play a crucial role in driving thought leadership and innovation in the field of image processing and analysis. This position offers a unique opportunity to work on cutting-edge projects and contribute to the growth and success of Adani while fostering a culture of excellence and collaboration.\n\nRoles and Responsibilities\nAs an Image Scientist at Adani, you will be responsible for:\n- Developing and implementing advanced algorithms and models for image recognition, segmentation, and feature extraction.\n- Collaborating with cross-functional teams to design and optimize image processing pipelines and workflows.\n- Contributing to the development and enhancement of AI-based systems for image interpretation and understanding.\n- Utilizing machine learning and deep learning techniques to extract meaningful insights from image data.\n- Evaluating and validating the performance of image processing algorithms through rigorous testing and analysis.\n- Communicating complex technical concepts and findings to non-technical stakeholders in a clear and concise manner.\n- Participating in the creation and maintenance of high-quality documentation and technical reports related to image science projects.\n- Continuously exploring new methodologies and technologies to improve the efficiency and accuracy of image analysis processes.\n- Adhering to industry best practices and standards while ensuring compliance with data privacy and security regulations.\n\nExperience\n- 8-13 years of experience in the Data Science and AI industry with a focus on image processing and analysis.\n\nEducation Qualification\n- Bachelor or master’s degree or Ph.D in Computer Science, Data Science, Artificial Intelligence, or a related field.\n\nCertification required\n- Certifications in machine learning, computer vision, or image processing would be an advantage.\n\nBehavioural Skills\n- Strong analytical and critical thinking skills.\n- Excellent problem-solving abilities and attention to detail.\n- Effective communication and collaboration skills.\n- Adaptability and willingness to learn and explore new technologies.\n\nTechnical Skills\n- Proficiency in programming languages such as Python, R, or Java.\n- Experience with machine learning frameworks and libraries, such as TensorFlow, Keras, or PyTorch.\n- Working knowledge of image processing tools and libraries, such as OpenCV, scikit-image, or PIL.\n- Familiarity with deep learning architectures and techniques for image analysis.\n- Experience with cloud platforms and services for data storage and processing, such as AWS, Azure, or GCP.\n\nNon-Negotiable Skills\n- Proficiency in image processing techniques and computer vision algorithms\n- Advanced knowledge of machine learning, deep learning, and neural networks\n- Cloud development and deployment of AI systems.",
        "experience_required": "8-13 years"
      },
      {
        "title": "Senior - Digital",
        "salary": "Not Disclosed",
        "company": "EY",
        "location": "Kolkata",
        "job_description": "As part of EY GDS Assurance Digital, you will be responsible for implementing innovative ideas through AI research to develop high growth impactful products. You will be helping EY’s sector and service line professionals by developing analytics enabled solutions, integrating data science activities with business relevant aspects to gain insight from data. You will work with multi-disciplinary teams across the entire region to support global clients. This is a core full-time AI developer role, responsible for creating innovative solutions by applying AI based techniques for business problems.",
        "experience_required": "3 - 6 years"
      },
      {
        "title": "Manager/Senior Manager, Data Science Specialist",
        "salary": "",
        "company": "Genpact",
        "location": "Kolkata, Gurgaon/Gurugram, Bangalore/Bengaluru",
        "job_description": "This role requires a seasoned professional as a Senior Manager, to spearhead our data science initiatives, drive innovation, and leverage advanced analytics to optimize business strategies with a focus on the Banking, Financial Services, and Insurance (BFSI) sector. Responsibilities include providing thought leadership, developing and executing comprehensive data science strategies, designing predictive models, utilizing advanced analytics, collaborating with business stakeholders, and mentoring junior team members.",
        "experience_required": "8 to 13 years"
      },
      {
        "title": "Data Scientist",
        "salary": "Not Disclosed",
        "company": "RS Software",
        "location": "Kolkata",
        "job_description": "We are seeking a talented and driven Data Scientist to join our team and contribute to the development of advanced analytics solutions, including fraud detection, stream analytics, and predictive modelling. The ideal candidate will have 3-5 years of hands-on experience designing and deploying machine learning models and a passion for uncovering insights from data. In this role, you will collaborate with cross-functional teams, including engineering, product, and data science, to create and optimize data pipelines, develop innovative analytics models, and enhance our understanding of complex patterns in digital payments and beyond. Familiarity with digital payments, fraud detection, Gen AI, and real-time data processing is a strong advantage.",
        "experience_required": "5-7 years"
      },
      {
        "title": "Digital Data Scientist - Manager",
        "salary": "Not Disclosed",
        "company": "EY",
        "location": "Kolkata",
        "job_description": "As part of EY GDS Assurance Digital, you will be responsible for implementing innovative ideas through AI research to develop high growth & impactful products. You will be helping EY's sector and service line professionals by developing analytics enabled solutions, integrating data science activities with business relevant aspects to gain insight from data. You will work with multi-disciplinary teams across the entire region to support global clients. This is a core full-time AI developer role, responsible for creating innovative solutions by applying AI based techniques for business problems. As our in-house senior AI engineer, your expertise and skills will be vital in our ability to steer one of our Innovation agenda.",
        "experience_required": "6 - 12 years"
      },
      {
        "title": "Data Scientist",
        "salary": "3.5-6.5 Lacs PA",
        "company": "ThatWare",
        "location": "Kolkata",
        "job_description": "Experience in coding, NLP, and ML activities. Build processes using NLP and ML techniques.",
        "experience_required": "1-5 Yrs"
      },
      {
        "title": "Data Scientist - Marketing",
        "salary": "Not disclosed",
        "company": "Eleven Labs",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Experience building and scaling marketing measurement frameworks from the ground up.",
        "experience_required": "2-6 Yrs"
      },
      {
        "title": "Data Scientist - Product",
        "salary": "Not disclosed",
        "company": "Rapid Canvas",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "User Experience Focus: Work with product and design teams to build user-centric features.",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "MX Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Extra points for work focused on customer satisfaction and engagement.",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Comscore",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Understand traditional (TV) media math and targeting concepts.",
        "experience_required": "2-4 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Gforce Consulting Solutions",
        "location": "Kolkata, Pune, Gurugram",
        "job_description": "He / she should be able to mentor junior or associate data scientists / interns.",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Open Insights",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Developing machine learning models against datasets to generate insights.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Rebaca Technologies",
        "location": "Kolkata",
        "job_description": "Experience in AI / ML, Data Science, CNN, RNN, LLM Classification, Clustering.",
        "experience_required": "3-5 Yrs"
      },
      {
        "title": "Data Scientist ( GenAI Specialization )",
        "salary": "Not disclosed",
        "company": "URS Systems",
        "location": "Kolkata, Chennai, Bengaluru",
        "job_description": "Bachelors degree in computer science engineering, Statistics, Mathematics, or a related field.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Krazy Mantra Group Of Companies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Krazy Mantra Group of Companies is looking for Data Scientist to join our dynamic team.",
        "experience_required": "6-9 Yrs"
      },
      {
        "title": "Data Scientist- Fixed Income",
        "salary": "Not disclosed",
        "company": "Rarr Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Develop maintain and leverage model training and inference pipelines using enterprise level tools.",
        "experience_required": "8-12 Yrs"
      },
      {
        "title": "Senior Machine Learning Data Scientist - Product Security",
        "salary": "Not disclosed",
        "company": "Bungie",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "This range is determined by an array of factors, including training, transferable skills.",
        "experience_required": "6-11 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Systechcorp Inc",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Minimum Qualifications Bachelors or Masters degree in Data Science, Computer Science, Statistics.",
        "experience_required": "3-7 Yrs"
      },
      {
        "title": "Data Scientist (Prompt Engineers)",
        "salary": "15-30 Lacs P.A.",
        "company": "Amit Gaikwad",
        "location": "Pune, Bangalore Rural",
        "job_description": "Deliver initiatives per AI strategy, Data Science Process. Prepare training tools for prompting. Exp in Agile principles, designing data science experiments, validating models, problem statements, interpretation, business implications. AI writing prompts. Required Candidate profile: Exp in EDA, Azure MS DevOps Snowflake, Databricks, Python/Spark, CI/CD, Sci-Kit Learn, Git. AI implementation, Algorithms, Agile Principles, Business & Data Analysis, Statistics, Random Forest, Case Study.",
        "experience_required": "5 - 10 years"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Digital Glyde",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Ideal candidate should have a degree in a quantitative field mathematics, computer science.",
        "experience_required": "3-7 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Intersoft Kk",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Bachelors / Masters degree in a quantitative discipline, e.g., Computer Science, Mathematics.",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "Data Scientist - LLM / GenAi",
        "salary": "Not disclosed",
        "company": "Response Informatics",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "LLM as mandatory experience in use case implementation. Researching and implementing applications.",
        "experience_required": "2-6 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Rezultize",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Proven experience as a Data Scientist or Data Analyst (minimum 3 years). Experience with data mining.",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Roblox",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "5+ years of experience as a data scientist, data engineer, or related role.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Data Scientist/ML Engineer - India",
        "salary": "Not disclosed",
        "company": "Pursuit Software Development",
        "location": "Kolkata",
        "job_description": "Bachelors / Masters / research degree in applied Statistics, Computer Science with machine learning.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "KloudPortal-SaaS Product Development and Marketing Agency",
        "location": "Kolkata, Hyderabad, Bengaluru",
        "job_description": "Liaison with on site and client teams to understand business requirements.",
        "experience_required": "3-10 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Motivity Labs",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Apply your sound theoretical knowledge and practical experience with statistical modeling.",
        "experience_required": "5-7 Yrs"
      },
      {
        "title": "Data Scientist & ML developer",
        "salary": "Not disclosed",
        "company": "Response Informatics",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Data Collection: Gathering and analyzing data.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not Disclosed",
        "company": "Saaki Argus And Averil Consulting",
        "location": "Bangalore Rural, Bengaluru",
        "job_description": "Develop and implement data models and algorithms to drive actionable insights and business decisions. Analyze complex datasets to extract meaningful patterns and trends. Collaborate with cross-functional teams to design and deliver data-driven solutions. Create dashboards, visualizations, and reports to communicate findings effectively. Optimize and enhance data pipelines to ensure efficiency and scalability. Stay updated with the latest tools, technologies, and industry trends in data science and analytics.",
        "experience_required": "3 - 8 years"
      },
      {
        "title": "Data Scientist - Gen AI",
        "salary": "12-15 Lacs P.A.",
        "company": "Cygnus A D Management Consulting Llp",
        "location": "Bangalore Rural, Bengaluru",
        "job_description": "Experience: 2-4 years\nPrimary Skills: Generative AI (LLM), Machine Learning, Python\nSecondary Skills: Problem Solving\nSoft skills: Communication, Ownership\nLocation - Bangalore - Kadubeeshnahali\nRole: Data Scientist,\nIndustry Type: IT Services & Consulting,\nDepartment: Data Science & Analytics,\nEmployment Type: Full Time, Permanent\nRole Category: Data Science & Machine Learning\nEducation: UG: Any Graduate\nKey Skills: Generative AI, Problem Solving, LLM, Machine Learning, Large Language Models, Python.",
        "experience_required": "2 - 7 years"
      },
      {
        "title": "Data Scientist / Senior Data Scientist / Lead Data Scientist",
        "salary": "Not Disclosed",
        "company": "Tavant Technologies",
        "location": "Hyderabad/Bangalore/Noida/Pune/Kolkata",
        "job_description": "We are seeking a highly skilled Data Scientist with expertise in Natural Language Processing (NLP) and Generative AI. The ideal candidate will have a strong background in Python, data science, and experience with state-of-the-art AI technologies including Langchain, Retrieval-Augmented Generation (RAG), and vector databases. Additionally, proficiency with AWS cloud services is essential. This role involves developing, deploying, and optimizing AI models that enhance our products and services.",
        "experience_required": "7-20 years"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Myntra",
        "location": "Bengaluru",
        "job_description": "People with MTech, MS by Research or PhD in Computer Science / Electrical Engineering, ... - Supply chain - Computer vision - Operations research - data science - Neural networks - Machine learning - Data structures - Natural language processing",
        "experience_required": "0-5 Yrs"
      },
      {
        "title": "Data Scientist - Cybersecurity",
        "salary": "Not disclosed",
        "company": "Visa",
        "location": "Bengaluru",
        "job_description": "Visas Cybersecurity team provides enterprise-wide, risk-based cybersecurity policies, ... - Automation - Information security - Analytical - Machine learning - Data structures - Open source - Analytics - Monitoring",
        "experience_required": "2-6 Yrs"
      },
      {
        "title": "Data Scientist - Generative AI",
        "salary": "Not disclosed",
        "company": "Philips",
        "location": "Bengaluru",
        "job_description": "bachelors or masters degree in computer science, AI, Data Science, Machine Learning, or... - Computer vision - deep learning - Diversity and Inclusion - Machine learning - Healthcare - Natural language processing - Open source - SQL",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "HCLTech",
        "location": "Hybrid - Hyderabad, Bengaluru",
        "job_description": "Experience with Open Source LLM and Langchain Framework and and designing efficient prompt for LLMsExperience to deploy and monitor model in cloud environmentCommunicate results effectively to technical and non-technical stakeholders. Work experience background required: . Essential skillsets required: . 3-6 years experience in software development",
        "experience_required": "3-5 Yrs"
      },
      {
        "title": "Data Scientist",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Masters degree in Computer Science, Statistics, Mathematics, or a related field7+ years... - Cloud computing - Team management - Software configuration management - Machine learning - Agile - Data processing - SDLC - Analytics",
        "experience_required": "9-11 Yrs"
      },
      {
        "title": "Data Scientist-Gen AI",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Anchor ML development track in a client project Data collection, profiling, EDA & data ... - data science - Project management - Machine learning - Data collection - Programming - Manager Technology - model development - SQL",
        "experience_required": "9-16 Yrs"
      },
      {
        "title": "Big Data Engineer - PySpark & Delta Lake on Microsoft Fabric",
        "salary": "Not Disclosed",
        "company": "Experiture",
        "location": "Kolkata, Bengaluru",
        "job_description": "We are seeking a highly skilled Big Data Engineer with deep expertise in migrating complex SQL stored procedures to PySpark on Microsoft Fabric, and extensive experience in Delta Lake. The ideal candidate will be responsible for translating existing SQL-based logic into efficient PySpark workflows, managing large-scale data operations, and ensuring seamless orchestration of these workflows through the application layer. This role is crucial to optimizing our data management processes by moving away from SQL-based operations and leveraging the scalability and efficiency of distributed data processing using PySpark on Microsoft Fabric.",
        "experience_required": "5 - 10 years"
      },
      {
        "title": "Data Analyst / Sr. Data Analyst",
        "salary": "Not Disclosed",
        "company": "Coreinsightsai",
        "location": "Remote",
        "job_description": "At CoreInsightsAI we are looking for a Data Analyst who will be the vital link between our information technology capacity and our business objectives by supporting and ensuring the successful completion of analytical, building, testing and deployment tasks of our product's features. The ideal candidate will use their passion for big data and analytics to provide insights to the business covering a range of topics. They will be responsible for conducting both recurring and ad hoc analysis for business user. Understand the day-to-day issues that our business faces, which can be better understood with data. Compile and analyze data related to business issues. Develop clear visualizations to convey complicated data in a straightforward fashion.",
        "experience_required": "5 - 8 years"
      },
      {
        "title": "Data Science Specialist",
        "salary": "Not disclosed",
        "company": "GE India Ltd",
        "location": "Bengaluru",
        "job_description": "Bachelor's Degree in Computer Science or STEM Majors (Science Technology Engineering Mathematics). Responsibilities include data cleansing, risk assessment, machine learning, data quality, data analytics, and data visualization.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Data Science Senior Analyst",
        "salary": "Not disclosed",
        "company": "Pepsico",
        "location": "Hyderabad",
        "job_description": "BE/B.Tech in Computer Science or related field with 9+ years of Data Science experience. Responsibilities include data analysis, Jenkins, SQL syntax, DevOps, Docker, Pyspark development, and statistical/ML techniques.",
        "experience_required": "9-14 Yrs"
      },
      {
        "title": "Senior Manager (Data Science)",
        "salary": "Not disclosed",
        "company": "Visa",
        "location": "Bengaluru",
        "job_description": "10 or more years of relevant work experience with a bachelor's degree or at least 8 years of experience with a master's degree. Responsibilities include data analysis, machine learning, predictive modeling, and management.",
        "experience_required": "10-15 Yrs"
      },
      {
        "title": "Data Science Senior Manager",
        "salary": "Not disclosed",
        "company": "Visa",
        "location": "Bengaluru",
        "job_description": "Bachelor's or Master's degree in Computer Science, Data Science, Statistics, or a related field. Responsibilities include coding, GCP, machine learning, resource management, and stakeholder management.",
        "experience_required": "10-15 Yrs"
      },
      {
        "title": "Data Science - Lead",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Pune",
        "job_description": "Hands-on experience with data preprocessing, fine-tuning, feature engineering, and model deployment. Responsibilities include computer vision, data analysis, artificial intelligence, and natural language processing.",
        "experience_required": "9-15 Yrs"
      },
      {
        "title": "Director, Data Science",
        "salary": "Not disclosed",
        "company": "Gartner",
        "location": "Gurugram",
        "job_description": "8+ years of experience in the data science domain with at least 2 years of experience managing teams. Responsibilities include product management, predictive modeling, application development, and recruitment.",
        "experience_required": "10-14 Yrs"
      }
    ]
  }
]