[
  {
    "jobs": [
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "Not Disclosed",
        "company": "Collinson",
        "location": "Mumbai",
        "job_description": "- Working on all stages of projects (planning, development, quality control, production)\n\n- Design, build and ongoing maintenance of our strategic platform and tooling.\n\n- Producing machine learning models including supervised and unsupervised methods\n\n- Rapidly prototyping proof-of-concept idea\n\n- Converting proof-of-concept projects to enterprise solutions\n\n- Producing reports and presentations to communicate findings to stakeholders\n\n- Investigate and understand emerging trends in data-related approaches, performing horizon-scanning that present current and future opportunities for the business.\n\n**Team Working**\n\n- Be an active member of the data & analytics team, contribute to team dynamics, ways of working and assisting with improvement opportunities\n\n- Be an active member of internal Data and Analytics communities to contribute to team dynamics, ways of working and assisting with improvement opportunities\n\n- Provide regular and accurate reports of progress to technical leads and the Project lead where required.\n\n- Build strong relationships with stakeholders with a view to providing high-value solutions within the business whilst keeping communication channels always open\n\n- Maintain strong technical awareness and familiarity with new and upcoming technologies around Data Integration and Business Intelligence Analysis. Be prepared to give a presentation or provide mentoring of any new technology or skills acquired in a collegiate environment\n- Stay abreast of the industry and participate in external communities to keep up to date and offer the most informed position when defining or consulting on solution design\n\n**Knowledge**\n\n- Knowledge of common data science techniques including data preparation, exploration and visualisation.\n\n- Knowledge of data mining techniques in one or more areas of statistical modelling methods, time series, text mining, optimization, information retrieval.\n\n- Ability to produce workflows using classification, clustering, regression, and dimensionality reduction.\n\n- Ability to prototype statistical analysis and modelling algorithms and apply these algorithms for data driven solutions to problems in new domains.\n\n- Ability to prototype statistical analysis and modelling algorithms and apply these algorithms for data driven solutions to problems in new domains.\n\n- Knowledge of industry best practice in deploying data science solutions\n\n- Strong knowledge of the AWS we'll Architected Framework(s)\n\nRole: Machine Learning Engineer,\n\nIndustry Type: Travel & Tourism,\n\nDepartment: Data Science & Analytics,\n\nEmployment Type: Full Time, Permanent\n\nRole Category: Data Science & Machine Learning\n\nEducation\n\nUG: Any Graduate\n\nPG: Any Postgraduate\n\nKey Skills\n\nText mining, Statistical analysis, Prototype, data science, Consulting, Machine learning, Information retrieval, Data mining, Business intelligence, Analytics.",
        "experience_required": "5 to 8 years"
      },
      {
        "title": "Data Scientist/Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "ANZ",
        "location": "Bengaluru",
        "job_description": "Experience building and deploying pipelines for Model training, deployment and monitoring. Skills required include Statistical modeling, Data management, data science, Analytical, Machine learning, Data processing, Data quality, Customer engagement.",
        "experience_required": "2-7 Yrs"
      },
      {
        "title": "Machine Learning Engineer 1 (Data Platform)",
        "salary": "Not disclosed",
        "company": "Demandbase",
        "location": "Bengaluru, Hyderabad",
        "job_description": "Hands-on experience with cutting-edge AI / ML and MLOps technologies. Skills required include SAN, System architecture, C++, Automation, Software design, NoSQL, Machine learning, Monitoring.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "CN Solutions",
        "location": "Bengaluru",
        "job_description": "Skills required include machine learning, python, ML, AI, Data engineering, Data.",
        "experience_required": "2-4 Yrs"
      },
      {
        "title": "Machine Learning Engineer - Apple Store Online",
        "salary": "Not disclosed",
        "company": "Apple India",
        "location": "Bengaluru",
        "job_description": "Skilled in communication, problem solving, strategic thinking. Bachelors in a quantitative field. Skills required include C++, Data analysis, Machine learning, Data processing, big data, Distribution system, Object oriented programming, SQL.",
        "experience_required": "3-10 Yrs"
      },
      {
        "title": "Machine Learning Engineer 4",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Bengaluru, Noida",
        "job_description": "The development engineer will be part of a team working on the development, operation, and maintenance of machine learning systems. Skills required include Debugging, Machine learning, Cloud, Programming, Splunk, Product design, Adobe, Monitoring.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Artificial Intelligence Engineer Machine Learning/NLP",
        "salary": "Not disclosed",
        "company": "Heycoach",
        "location": "Bengaluru",
        "job_description": "3+ years in AI/ML with expertise in audio-video processing and NLP. Develop AI systems for various applications. Skills required include python, video processing, STT, cutting, debugging, TT, C++, natural language processing.",
        "experience_required": "4-7 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Anheuser Busch InBev",
        "location": "Bengaluru",
        "job_description": "Bachelors or master's degree in Computer Science, Engineering, or a related field. Work on backend product engineering. Skills required include Backend, Product engineering, orchestration, Machine learning, Natural language processing, SDK, application architecture, Monitoring.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Machine Learning Engineer, Amazon Music Search",
        "salary": "Not disclosed",
        "company": "Amazon",
        "location": "Bengaluru",
        "job_description": "3+ years of non-internship professional software development experience. Bachelors degree in Computer Science or related field. Skills required include Computer science, Training, Machine learning, Architectural design, Programming, Workflow, Deployment, Customer experience.",
        "experience_required": "0-4 Yrs"
      },
      {
        "title": "Machine Learning Engineer 2 (Data Platform)",
        "salary": "Not disclosed",
        "company": "Demandbase",
        "location": "Bengaluru, Hyderabad",
        "job_description": "Experience in Spark, and multi-agent systems. Skills required include SAN, System architecture, C++, Automation, Software design, data science, Troubleshooting, SQL.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Python Machine learning Engineer",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Azure Certified - DP100, AZ / AI900 Azure AZ-900 Certification with Azure Architecture. Skills required include Automation, Data analysis, Coding, Consulting, Machine learning, Agile, JIRA, SQL.",
        "experience_required": "3-5 Yrs"
      },
      {
        "title": "Machine Learning Engineer (MLOPS)",
        "salary": "Not disclosed",
        "company": "Tiger Analytics",
        "location": "Hybrid - Bengaluru, Pune, Delhi / NCR",
        "job_description": "Role & responsibilities include working with MLops, Machine Learning Algorithms, Deployment, Python, Machine Learning, AWS, Azure.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Iqvia Biotech",
        "location": "Bengaluru",
        "job_description": "Develop fit for purpose AIML models/algorithms/processes to add value to the business. Skills required include Computer science, Automation, C++, Pharma, Project management, Machine learning, Clinical research, Healthcare.",
        "experience_required": "2-4 Yrs"
      },
      {
        "title": "Staff Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Abbyy",
        "location": "Bengaluru, Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai",
        "job_description": "Guide architectural decisions for computer vision and multimodal systems. Drive innovation in machine learning. Skills required include Computer science, Computer vision, Automation, Machine learning, System design, Healthcare, Wellness, Technical Lead.",
        "experience_required": "8-12 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Bachelors or Masters degree in Computer Science, Machine Learning, Data Science, or a related field. Skills required include Machine Learning, Jenkins, SAP ECC, ELK stack, Azure ML DevOps, GitLab CI/CD, Prometheus, Grafana.",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "30-45 Lacs PA",
        "company": "Uberlife Consulting",
        "location": "Bengaluru",
        "job_description": "Proficient in Python, experience in Java or Scala, familiarity with messaging queues and machine learning algorithms.",
        "experience_required": "2-7 Yrs"
      },
      {
        "title": "Machine Learning (ML) Engineer",
        "salary": "Not disclosed",
        "company": "Kloud9",
        "location": "Bengaluru, Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai",
        "job_description": "Experience & Skills Fitment: 6+ years of IT experience in which at least 2+ years of experience in Machine Learning. Skills required include Computer science, Usage, Linux, data science, GCP, Machine learning, Deployment, Data quality.",
        "experience_required": "6-10 Yrs"
      },
      {
        "title": "Artificial intelligence / Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Cotocus Com",
        "location": "Bengaluru",
        "job_description": "Desired Skills and Experience include CSS, HTML5, Computer science, Analytical skills, Artificial Intelligence, Business Economics, Machine learning, Javascript, Business management, Information technology.",
        "experience_required": "2-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Aanseaa Technologies",
        "location": "Bengaluru, Chennai, Delhi / NCR",
        "job_description": "Experienced in Machine Learning with expertise in AWS SageMaker and Azure AD. Skills required include Machine Learning, Azure Active Directory, Azure AD, AWS Sage Maker, MLOps principles, AWS, Microsoft Azure, SAGE.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Senior AI/ML Developer",
        "salary": "7-8.5 Lacs P.A.",
        "company": "Ispeck Digital Solutions Pvt Ltd",
        "location": "Kolkata",
        "job_description": "Ispeck Digital Solutions Pvt Ltd, a Kolkata based AI/ML innovative startup (operating since 2021) and working with reputed foreign collaborations, is seeking an experienced hands-on AI/ML Engineer / Full Stack Data Scientist to lead the development, deployment, and optimization of our machine learning infrastructure, with a particular focus on vision models, LLM/SLMs, and advanced ML systems. Key Responsibilities: - Design and implement end-to-end machine learning solutions, including LLMs, SLMs, and computer vision models - Lead research initiatives to improve model performance and explore cutting-edge AI technologies - Develop and maintain ML pipelines in cloud environments using containerization and orchestration tools - Optimize model performance, scalability, and efficiency across our AI infrastructure - Drive technical decision-making for AI/ML architecture and implementation strategies. Required Qualifications: - Master's or PhD in Computer Science, Machine Learning, or related field - 5+ years of hands-on experience developing and deploying production ML models - Strong expertise in modern deep learning frameworks (PyTorch, TensorFlow) - Proven experience with LLMs, transformer architectures, and vision models, ViT - Advanced knowledge of cloud platforms (AWS/GCP/Azure) and MLOps practices - Proficiency in containerization (Docker) and orchestration (Kubernetes) - Extensive knowledge of modern GPU and Edge Devices architecture like Jetson, Raspberry, Xylinx or similar. Technical Skills: - Deep learning and neural network architectures - Encoder/Decoder/Transformer architectures - Natural Language Processing and Computer Vision - Distributed computing and model parallelization - CI/CD pipelines for ML workflows - Python, C/C++/Rust/Go/C#, SQL/NoSQL, and version control systems - Model optimization and fine-tuning techniques. Role & responsibilities: Preferred candidate profile: Only local Kolkata based candidates with requisite experience and qualifications as specified, should apply. We are not looking to hire outstation candidates. Perks and benefits: Performance Linked Incentive, Health Insurance, Leave Benefits. Candidates available to join within 30 days will be given preference.",
        "experience_required": "3 - 5 years"
      },
      {
        "title": "Senior Data Scientist-Computer Vision",
        "salary": "15-30 Lacs P.A.",
        "company": "Adani Group",
        "location": "Kolkata",
        "job_description": "We are seeking a dynamic and innovative Image Scientist with 8-13 years of experience in the Data Science and AI industry to join our team in Kolkata, West Bengal. As an Image Scientist, you will play a crucial role in driving thought leadership and innovation in the field of image processing and analysis. This position offers a unique opportunity to work on cutting-edge projects and contribute to the growth and success of Adani while fostering a culture of excellence and collaboration.\n\nRoles and Responsibilities\nAs an Image Scientist at Adani, you will be responsible for:\n- Developing and implementing advanced algorithms and models for image recognition, segmentation, and feature extraction.\n- Collaborating with cross-functional teams to design and optimize image processing pipelines and workflows.\n- Contributing to the development and enhancement of AI-based systems for image interpretation and understanding.\n- Utilizing machine learning and deep learning techniques to extract meaningful insights from image data.\n- Evaluating and validating the performance of image processing algorithms through rigorous testing and analysis.\n- Communicating complex technical concepts and findings to non-technical stakeholders in a clear and concise manner.\n- Participating in the creation and maintenance of high-quality documentation and technical reports related to image science projects.\n- Continuously exploring new methodologies and technologies to improve the efficiency and accuracy of image analysis processes.\n- Adhering to industry best practices and standards while ensuring compliance with data privacy and security regulations.\n\nExperience\n- 8-13 years of experience in the Data Science and AI industry with a focus on image processing and analysis.\n\nEducation Qualification\n- Bachelor or master’s degree or Ph.D in Computer Science, Data Science, Artificial Intelligence, or a related field.\n\nCertification required\n- Certifications in machine learning, computer vision, or image processing would be an advantage.\n\nBehavioural Skills\n- Strong analytical and critical thinking skills.\n- Excellent problem-solving abilities and attention to detail.\n- Effective communication and collaboration skills.\n- Adaptability and willingness to learn and explore new technologies.\n\nTechnical Skills\n- Proficiency in programming languages such as Python, R, or Java.\n- Experience with machine learning frameworks and libraries, such as TensorFlow, Keras, or PyTorch.\n- Working knowledge of image processing tools and libraries, such as OpenCV, scikit-image, or PIL.\n- Familiarity with deep learning architectures and techniques for image analysis.\n- Experience with cloud platforms and services for data storage and processing, such as AWS, Azure, or GCP.\n\nNon-Negotiable Skills\n- Proficiency in image processing techniques and computer vision algorithms\n- Advanced knowledge of machine learning, deep learning, and neural networks\n- Cloud development and deployment of AI systems",
        "experience_required": "8 - 13 years"
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Paypal",
        "location": "Bengaluru",
        "job_description": "Minimum experience: Minimum 4+ years of experience OR Masters degree with 2+ years of experience in deep learning, Business transformation, data science, Artificial Intelligence, Diversity and Inclusion, Machine learning, Application development, Analytics.",
        "experience_required": "4-9 Yrs"
      },
      {
        "title": "Sr. Data Scientist / Machine Learning Engineer - Gen AI & LLM",
        "salary": "Not disclosed",
        "company": "Databricks",
        "location": "Bengaluru",
        "job_description": "Experience building production-grade machine learning deployments on AWS, Azure, or GCP. Skills include SAN, Operations research, data science, GCP, spark, Diversity and Inclusion, Machine learning, Data analytics.",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Principal Data Scientist/Senior Data Scientist - NLP/Machine Learning",
        "salary": "Not disclosed",
        "company": "Benovymed Healthcare",
        "location": "Gurugram",
        "job_description": "Principal Data Scientist/Senior Data Scientist/Data Scientist - NLP/Machine Learning. Skills include Machine Learning, ANN, deep learning, AI Modelling, CNN, NLP, RNN, Natural Language Processing.",
        "experience_required": "0-5 Yrs"
      },
      {
        "title": "Senior Machine Learning Engineer (Generative AI)",
        "salary": "Not disclosed",
        "company": "Zensar",
        "location": "Pune",
        "job_description": "Essential Requirements: The ideal candidate combines deep technical expertise with practical experience in machine learning, artificial intelligence, and cloud technologies.",
        "experience_required": "5-7 Yrs"
      },
      {
        "title": "Senior Machine Learning Engineer, Amazon QuickSight",
        "salary": "Not disclosed",
        "company": "Amazon",
        "location": "Bengaluru",
        "job_description": "5+ years of non-internship professional software development experience. Achieving success in cloud computing, web services, machine learning, architectural design, natural language processing.",
        "experience_required": "5-6 Yrs"
      },
      {
        "title": "Senior Machine Learning Engineer - SMAI PEOPLE",
        "salary": "Not disclosed",
        "company": "Micron Software",
        "location": "Hyderabad",
        "job_description": "Adapts machine learning to areas such as virtual reality, augmented reality, artificial intelligence, and more.",
        "experience_required": "3-7 Yrs"
      },
      {
        "title": "Machine Learning Engineer 4",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Noida, Bengaluru",
        "job_description": "The development engineer will be part of a team working on the development, operation, and maintenance of machine learning systems.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Machine Learning Scientist III",
        "salary": "Not disclosed",
        "company": "Expedia",
        "location": "Bengaluru",
        "job_description": "You will seek relevant academic papers and experience to point out strengths and weaknesses in machine learning models.",
        "experience_required": "6-9 Yrs"
      },
      {
        "title": "Senior Machine Learning Engineer (Data Platform)",
        "salary": "Not disclosed",
        "company": "Demandbase",
        "location": "Hyderabad, Bengaluru",
        "job_description": "Experience in Spark, and multi-agent systems. We acknowledge that true diversity and inclusion are essential.",
        "experience_required": "4-7 Yrs"
      },
      {
        "title": "Senior Machine Learning Engineer, Amazon Music Search",
        "salary": "Not disclosed",
        "company": "Amazon",
        "location": "Bengaluru",
        "job_description": "We are looking for a highly-skilled Senior Machine Learning Engineer to lead the development of machine learning models.",
        "experience_required": "0-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "CN Solutions",
        "location": "Bengaluru",
        "job_description": "Skills: Machine learning, python, ML, AI, Data engineer, Data.",
        "experience_required": "2-4 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Bachelors or Masters degree in Computer Science, Machine Learning, Data Science, or a related field.",
        "experience_required": "3-12 Yrs"
      },
      {
        "title": "Machine Learning Engineer - Apple Store Online",
        "salary": "Not disclosed",
        "company": "Apple India",
        "location": "Bengaluru",
        "job_description": "Skilled in communication, problem solving, strategic thinking. Bachelors in a quantitative field.",
        "experience_required": "3-10 Yrs"
      },
      {
        "title": "Machine Learning Engineer 4",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Noida",
        "job_description": "Bachelor's, Master's, or PhD in Computer Science, Machine Learning, Data Science, or a related field.",
        "experience_required": "6-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Welocalize",
        "location": "Hybrid - Noida",
        "job_description": "Incident Management: Conduct post-mortems and root cause analysis for system failures.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "AI/Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Nowcom Global Services",
        "location": "Hybrid - Hyderabad",
        "job_description": "We are looking for AI / Machine Learning Engineer with 4+ years of experience.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "LLM Machine Learning Engineer",
        "salary": "35-45 Lacs PA",
        "company": "Orangepeople",
        "location": "Remote",
        "job_description": "OrangePeople, were more than a consulting firm, we are a people-first, high-touch organization.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Machine Learning Engineer (MLOPS)",
        "salary": "Not disclosed",
        "company": "Tiger Analytics",
        "location": "Hybrid - Pune, Bengaluru, Delhi / NCR",
        "job_description": "Curious about the role? What your typical day would look like?.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Machine Learning Engineer 5",
        "salary": "Not disclosed",
        "company": "Keysight Technologies",
        "location": "Gurugram",
        "job_description": "Qualifications: Master’s or PhD degree in Computer Science, Information Technology, Engineering.",
        "experience_required": "5-13 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Cilag",
        "location": "Mumbai",
        "job_description": "Qualifications: A Bachelor or Master’s degree with 2 years of experience within a startup.",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "Machine Learning Engineer 4",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Noida, Bengaluru",
        "job_description": "The development engineer will be part of a team working on the development, operation.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Python Machine learning Engineer",
        "salary": "Not disclosed",
        "company": "Infosys",
        "location": "Bengaluru",
        "job_description": "Azure Certified - DP100, AZ / AI900 Azure AZ-900 Certification with Azure Architecture.",
        "experience_required": "3-5 Yrs"
      },
      {
        "title": "Artificial Intelligence/Machine Learning Engineer Computer Vision",
        "salary": "Not disclosed",
        "company": "Ctruh",
        "location": "Bengaluru",
        "job_description": "Working Days: Monday to Friday: Work from Office. Saturday: Work from Home.",
        "experience_required": "3-5 Yrs"
      },
      {
        "title": "Machine Learning Engineer, Amazon Music Search",
        "salary": "Not disclosed",
        "company": "Amazon",
        "location": "Bengaluru",
        "job_description": "3+ years of non-internship professional software development experience.",
        "experience_required": "0-4 Yrs"
      },
      {
        "title": "Machine Learning Engineer 1 (Data Platform)",
        "salary": "Not disclosed",
        "company": "Demandbase",
        "location": "Hyderabad, Bengaluru",
        "job_description": "Hands-on experience with cutting-edge AI / ML and MLOps technologies.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Machine Learning Engineer 3",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Noida",
        "job_description": "Broad Machine Learning experience - Data, Modelling, Metric, Analysis of Results.",
        "experience_required": "3-8 Yrs"
      },
      {
        "title": "Staff Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Abbyy",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Guide architectural decisions for computer vision and multimodal systems.",
        "experience_required": "8-12 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "ServiceNow",
        "location": "Hyderabad, Ahmedabad",
        "job_description": "In equal measure, we lay the foundations, research, experiment, and de-risk AI technologies.",
        "experience_required": "2-10 Yrs"
      },
      {
        "title": "Machine Learning Engineer",
        "salary": "Not disclosed",
        "company": "Snow Planet",
        "location": "Hyderabad",
        "job_description": "In equal measure, we lay the foundations, research, experiment, and de-risk AI technologies.",
        "experience_required": "2-6 Yrs"
      },
      {
        "title": "Machine Learning Engineer 2 (Data Platform)",
        "salary": "Not disclosed",
        "company": "Demandbase",
        "location": "Hyderabad, Bengaluru",
        "job_description": "Experience in Spark, and multi-agent systems.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Senior Deep Learning / Computer Vision Engineer",
        "salary": "Not Disclosed",
        "company": "Artificial Learning Systems",
        "location": "Kolkata",
        "job_description": "We are seeking a Senior Deep Learning / Computer Vision Engineer to enhance our pioneering AI-driven diagnostic tools at Artelus. You will play a critical role in developing and refining algorithms that analyze medical imaging data, focusing on applications like diabetic retinopathy screening with DRISTi and retinal analysis using our portable 5g OCT device. Your expertise will drive innovations that improve the accuracy and functionality of our products, directly impacting patient outcomes globally.\n\nAbout you\nAs a seasoned engineer, you possess deep expertise in deep learning, computer vision, and machine learning frameworks. Your background includes substantial experience with neural networks, particularly in medical image analysis or similar fields. You are proficient in Python and familiar with AI frameworks like TensorFlow or PyTorch. Your approach to problem-solving is creative and efficient, aimed at developing solutions that are not only effective but also scalable and robust. You are enthusiastic about mentoring junior team members and leading by example in both technical and project management aspects. You value precision and are committed to advancing healthcare through technology. Additionally, experience with model containerization, API building, and deployment to Kubernetes environments is a plus, enhancing your ability to integrate advanced technologies into scalable production systems.\n\nYour Role\nIn this position, you will be responsible for:\n- Developing cutting-edge deep learning models that enhance our capability to diagnose and monitor various medical conditions.\n- Innovating and improving computer vision algorithms that integrate with our medical imaging devices.\n- Collaborating with cross-functional teams to integrate these technologies into our existing products.\n- Leading projects and initiatives that push the boundaries of what our technology can achieve in medical diagnostics.\n- Develop APIs and manage the deployment of models into production environments using containers and Kubernetes.\n\nResponsibilities\n- Lead the design and implementation of new features and algorithms for real-time medical image processing.\n- Optimize existing AI models to improve efficiency and accuracy.\n- Conduct research and apply the latest advancements in deep learning and computer vision to our product development.\n- Ensure the highest standards of quality and performance in all engineering efforts.\n- Develop APIs and manage the deployment of models into production environments using containers and Kubernetes.\n\nRequirements\nWe are looking for someone who is not just a technical expert but also a visionary in their field. The ideal candidate will have:\n- A strong theoretical and practical background in deep learning and computer vision.\n- Proven experience with Python and major AI frameworks like TensorFlow or PyTorch.\n- A track record of innovative problem-solving in complex, technically challenging environments.\n- Experience in medical image analysis is highly preferred.\n- Familiarity with model containerization, API development, and Kubernetes is highly regarded.\n\nWe offer you\n- The opportunity to be at the forefront of AI in healthcare, making significant impacts on global health.\n- A collaborative environment that values innovation and supports your professional growth.\n- A role where your contributions are directly linked to improving patient care and diagnostic accuracy across the world.",
        "experience_required": "1 - 5 years"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Accely",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Manage the end-to-end lifecycle of AI projects, including requirement gathering, design, usage, development testing, neural networks, artificial intelligence, machine learning, design development, IT sales, deployment.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Tech Stalwart Solution",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Requirements: Experience: 6+ years in AI and machine learning, with hands-on expertise in product engineering, data management, GCP, machine learning, system design, information retrieval, data processing, system development.",
        "experience_required": "6-8 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Relq Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Bachelor's degree or equivalent in Information Systems, Computer Science, or related field. Skills include data management, scalability, SAAS, cloud, product life cycle management, banking, conceptualization, open source.",
        "experience_required": "6-11 Yrs"
      },
      {
        "title": "Responsible AI Engineer",
        "salary": "Not disclosed",
        "company": "Accenture",
        "location": "Kolkata",
        "job_description": "Minimum 5 years of experience is required. Educational Qualification: 15 years full-time education. Skills include algorithms, tableau, linear regression, power bi, artificial intelligence, deep learning, python, natural language processing.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Appsbee",
        "location": "Kolkata",
        "job_description": "Fresher to 1 year experience in computer vision with strong coding skills in Python; Proficient in YOLO, OpenCV, Image Processing, Artificial Intelligence, Computer Vision, TensorFlow, CNN, ResNet50.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Principal Generative AI (GenAI) Engineer",
        "salary": "Not disclosed",
        "company": "Velocity Clinical Research",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Experience with APIs and microservices architecture for integrating AI solutions into existing systems. Skills include coding, neural networks, artificial intelligence, intellectual property, machine learning, clinical trials, clinical research, monitoring.",
        "experience_required": "8-13 Yrs"
      },
      {
        "title": "Gen AI Engineer",
        "salary": "Not disclosed",
        "company": "Biz Tecno",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Analyzing customer needs to determine appropriate solutions for complex technical issues. Skills include image processing, python, natural language processing, neural networks, machine learning, artificial intelligence, deep learning, tensorflow.",
        "experience_required": "1-4 Yrs"
      },
      {
        "title": "AI Engineer / Consultant / Developer",
        "salary": "Not disclosed",
        "company": "H3 Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Education: Bachelors or Masters degree in Computer Science, Engineering, or a related field. Skills include computer science, continuous integration, client solutions, data science, GCP, artificial intelligence, machine learning, data structures.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Principal AI Engineer",
        "salary": "Not disclosed",
        "company": "G P",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Your knowledge and experience will be crucial to helping design and develop high-quality AI solutions. Skills include computer science, automation, prototype, artificial intelligence, machine learning, agile, system design, data processing.",
        "experience_required": "5-9 Yrs"
      },
      {
        "title": "Principal AI Engineer",
        "salary": "Not disclosed",
        "company": "Globalization Partners International (GPI)",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Your knowledge and experience will be crucial to helping design and develop high-quality AI solutions. Skills include computer science, automation, prototype, artificial intelligence, machine learning, agile, system design, data processing.",
        "experience_required": "4-8 Yrs"
      },
      {
        "title": "Responsible AI Engineer",
        "salary": "Not disclosed",
        "company": "Accenture",
        "location": "Kolkata",
        "job_description": "Project Role: Responsible AI Engineer. Project Role Description: Assess AI systems for adherence to ethical guidelines and regulations. Skills include python, natural language processing, presentation skills, machine learning algorithms, statistics, algorithms, chatbot, nltk.",
        "experience_required": "7-12 Yrs"
      },
      {
        "title": "Founding AI Engineer",
        "salary": "Not disclosed",
        "company": "Dimension",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Preferred Skills and Experience: Experience with generative AI and their applications. Skills include cloud computing, computer vision, accessories, github, equity, agile, natural language processing, research.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Experiture Global",
        "location": "Kolkata(Sector 5 Salt Lake), Bengaluru",
        "job_description": "Required Skills and Qualifications: Bachelors or Masters degree in Computer Science, Engineering, or a related field. Skills include data science, data engineering, artificial intelligence, python, SQL, ML library, Azure Cloud, Onelake.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Engineer - Conversational AI",
        "salary": "Not disclosed",
        "company": "Voiceplug",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Candidates with experience in building and developing chatbots / voicebots are preferred. Skills include application design, coding, debugging, machine learning, data structures, silicon, troubleshooting, application software.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Artificial Intelligence Developer -Freelancer- Support Engineer",
        "salary": "Not disclosed",
        "company": "Hatigen Consulting Services",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Ability to write code in Python / R and other relevant programming languages. Knowledge of cloud computing, data analysis, consulting, agile, data structures, healthcare, scrum, data mining.",
        "experience_required": "6-8 Yrs"
      },
      {
        "title": "Senior AI Engineer",
        "salary": "Not disclosed",
        "company": "Encora",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Required Qualifications and Technical Skills Experience: 7-10 Years Experience: 7+ years in AI/ML engineering. Skills include computer vision, product engineering, cloud services, machine learning, quality engineering, manager technology, data analytics, SDK.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Sr. AI Engineer",
        "salary": "Not disclosed",
        "company": "Highpoints Technologies India",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Years of experience in AI/ML engineering. The role primarily focuses on designing, developing, and deploying AI solutions. Skills include computer science, cloud computing, NoSQL, coding, analytical, machine learning, data processing, natural language processing.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Senior AI Engineer",
        "salary": "Not disclosed",
        "company": "Impact Analytics",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Given preference to candidates with Masters or PhD in computing / systems, mathematics. Skills include supply chain, computer vision, deep learning, GCP, machine learning, natural language processing, mathematics, forecasting.",
        "experience_required": "4-6 Yrs"
      },
      {
        "title": "Lead Software Engineer - Python",
        "salary": "Not disclosed",
        "company": "JPMorgan Chase Bank",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "A good knowledge of Investment Banking and Markets is highly desirable but a thirst for learning is essential. Skills include post production, backend, lead software, TDD, analytical, debugging, test driven development, investment banking.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Machine Learning / AI Engineer",
        "salary": "Not disclosed",
        "company": "Zion Cloud Solutions",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Qualifications: 4+ years of experience in AI / ML, with a strong understanding of machine learning algorithms and frameworks. Skills include computer vision, deep learning, machine learning, cloud, deployment, mentor, natural language processing, research.",
        "experience_required": "4-6 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Accely",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Manage the end-to-end lifecycle of AI projects, including requirement gathering, design, usage, development testing, Neural networks, Artificial Intelligence, Machine learning, Design development, IT sales, Deployment",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Tech Stalwart Solution",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Requirements: Experience: 6+ years in AI and machine learning, with hands-on expertise in Product engineering, Data management, GCP, Machine learning, System design, Information retrieval, Data processing, System development.",
        "experience_required": "6-8 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Relq Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Bachelor's degree or equivalent in Information Systems, Computer Science, or related field. Skills include Data management, Scalability, SAAS, Cloud, Product life cycle management, Banking, Conceptualization, Open source.",
        "experience_required": "6-11 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Appsbee",
        "location": "Kolkata",
        "job_description": "Fresher to 1 year experience in computer vision with strong coding skills in Python; Proficient in YOLO, Opencv, Image Processing, Artificial Intelligence, Computer Vision, Tensorflow, Cnn, Resnet50.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Principal Generative AI (GenAI) Engineer",
        "salary": "Not disclosed",
        "company": "Velocity Clinical Research",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Experience with APIs and microservices architecture for integrating AI solutions into existing systems. Skills include Coding, Neural networks, Artificial Intelligence, Intellectual property, Machine learning, Clinical trials, Clinical research, Monitoring.",
        "experience_required": "8-13 Yrs"
      },
      {
        "title": "AI Engineer / Consultant / Developer",
        "salary": "Not disclosed",
        "company": "H3 Technologies",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Education: Bachelors or Masters degree in Computer Science, Engineering, or a related field. Skills include Computer science, continuous integration, Client solutions, data science, GCP, Artificial Intelligence, Machine learning, Data structures.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Principal AI Engineer",
        "salary": "Not disclosed",
        "company": "G P",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Here, your knowledge and experience will be crucial to helping design and develop high-quality AI solutions. Skills include Computer science, Automation, Prototype, Artificial Intelligence, Machine learning, Agile, System design, Data processing.",
        "experience_required": "5-9 Yrs"
      },
      {
        "title": "Founding AI Engineer",
        "salary": "Not disclosed",
        "company": "Dimension",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Preferred Skills and Experience: Experience with generative AI and their applications. Skills include Cloud computing, Computer vision, Accessories, github, Equity, Agile, Natural language processing, Research.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "AI Engineer",
        "salary": "Not disclosed",
        "company": "Experiture Global",
        "location": "Kolkata(Sector 5 Salt Lake), Bengaluru",
        "job_description": "Required Skills and Qualifications: Bachelors or Masters degree in Computer Science, Engineering, or a related field. Skills include Data Science, Data Engineering, Artificial Intelligence, Python, SQL, ML Library, Azure Cloud, Onelake.",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Engineer - Conversational AI",
        "salary": "Not disclosed",
        "company": "Voiceplug",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Candidates with experience in building and developing chatbots / voicebots are preferred. Skills include Application design, Coding, Debugging, Machine learning, Data structures, Silicon, Troubleshooting, Application software.",
        "experience_required": "1-3 Yrs"
      },
      {
        "title": "Artificial Intelligence Developer -Freelancer- Support Engineer",
        "salary": "Not disclosed",
        "company": "Hatigen Consulting Services",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Ability to write code in Python / R and other relevant programming languages. Knowledge of Cloud computing, Data analysis, Consulting, Agile, Data structures, Healthcare, Scrum, Data mining.",
        "experience_required": "6-8 Yrs"
      },
      {
        "title": "Senior AI Engineer",
        "salary": "Not disclosed",
        "company": "Encora",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Required Qualifications and Technical Skills Experience: 7-10 Years Experience: 7+ years in AI/ML engineering. Skills include Computer vision, Product engineering, Cloud Services, Machine learning, Quality engineering, Manager Technology, Data analytics, SDK.",
        "experience_required": "7-10 Yrs"
      },
      {
        "title": "Sr. AI Engineer",
        "salary": "Not disclosed",
        "company": "Highpoints Technologies India",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Years of experience in AI/ML engineering. The role primarily focuses on designing, developing, and deploying AI solutions. Skills include Computer science, Cloud computing, NoSQL, Coding, Analytical, Machine learning, Data processing, Natural language processing.",
        "experience_required": "3-6 Yrs"
      },
      {
        "title": "Senior AI Engineer",
        "salary": "Not disclosed",
        "company": "Impact Analytics",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Given preference to candidates with Masters or PhD in computing / systems, mathematics. Skills include Supply chain, Computer vision, deep learning, GCP, Machine learning, Natural language processing, Mathematics, Forecasting.",
        "experience_required": "4-6 Yrs"
      },
      {
        "title": "Lead Software Engineer - Python",
        "salary": "Not disclosed",
        "company": "JPMorgan Chase Bank",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "A good knowledge of Investment Banking and Markets is highly desirable but a thirst for learning is essential. Skills include Post production, Backend, Lead Software, TDD, Analytical, Debugging, test driven development, Investment banking.",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Machine Learning / AI Engineer",
        "salary": "Not disclosed",
        "company": "Zion Cloud Solutions",
        "location": "Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru",
        "job_description": "Qualifications: 4+ years of experience in AI / ML, with a strong understanding of machine learning algorithms and frameworks. Skills include Computer vision, deep learning, Machine learning, Cloud, Deployment, Mentor, Natural language processing, Research.",
        "experience_required": "4-6 Yrs"
      },
      {
        "title": "Artificial Intelligence /Machine Learning Engineer (AI/ML)-C2H",
        "salary": "12-22 Lacs PA",
        "company": "Keya Anand Solutions",
        "location": "Hybrid - Pune",
        "job_description": "Looking for AI/ML Developer- Contract to Hire -4+ Yrs -Pune -Long Term Contract to Hire... - Artificial Intelligence - Aiml - Machine Learning - Tensorflow - Natural Language Processing - Deep Learning - Ml - Languages",
        "experience_required": "4-9 Yrs"
      },
      {
        "title": "Data Scientist-AI/ML Engineer",
        "salary": "Not disclosed",
        "company": "Idexcel",
        "location": "Pune, Bengaluru, Mumbai (All Areas)",
        "job_description": "Experience with data preprocessing, feature engineering, and model evaluationExperience... - Artificial Intelligence - Machine Learning - Scikit-Learn - Python - Tensorflow - Hadoop - AI - Cloud Platform",
        "experience_required": "5-9 Yrs"
      },
      {
        "title": "AI / ML - Data Scientist",
        "salary": "Not disclosed",
        "company": "Neilsoft",
        "location": "Pune",
        "job_description": "Experience working on end-to-end data science pipeline: problem scoping, data gathering... - C++ - Image processing - AutoCAD - Analytical - Consulting - Machine learning - Data structures - Business solutions",
        "experience_required": "2-7 Yrs"
      },
      {
        "title": "Senior Software Engineer I, AI/ML",
        "salary": "Not disclosed",
        "company": "Kaplan Test Prep",
        "location": "Bengaluru",
        "job_description": "Bachelor s degree in Computer Science, Engineering, or a related field Proficiency in f... - Automation - Front end - Data modeling - Debugging - Machine learning - Javascript - HTML - SQL",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "AI/ML Engineer- Iqvia",
        "salary": "Not disclosed",
        "company": "IQVIA",
        "location": "Hybrid - Kochi, Noida, Bengaluru",
        "job_description": "Project Role: Senior AI / ML Engineer. Work Experience: 2 to 5 Years. Work Location is ... - Artificial Intelligence - Aiml - Machine Learning - Python - genAI - Natural Language Processing - Deep Learning - Ml",
        "experience_required": "2-5 Yrs"
      },
      {
        "title": "Senior Data Scientist - AI/ML Quantitative Interpretation",
        "salary": "Not disclosed",
        "company": "Halliburton",
        "location": "Bengaluru",
        "job_description": "We are looking for the right people people who want to innovate, achieve, grow and lead... - Mining - Product engineering - Data analysis - Simulation - GCP - Intellectual property - Machine learning - Forecasting",
        "experience_required": "0-5 Yrs"
      },
      {
        "title": "Senior Engineering Manager (AI/ML)",
        "salary": "Not disclosed",
        "company": "Adobe",
        "location": "Bengaluru",
        "job_description": ". What youll need to succeed . Masters or PhD in Computer Science, AI / ML or related f... - Product management - Matrix - Machine learning - Natural language processing - Research - Management - Adobe - Python",
        "experience_required": "10-15 Yrs"
      },
      {
        "title": "Lead - AI/ML",
        "salary": "Not disclosed",
        "company": "Tata Power",
        "location": "Mumbai (All Areas)",
        "job_description": "Cloud Skills: o Hands-on experience with cloud platforms like AWS and Azure, including:... - Aiml - AZURE - Video Analytics - voice analytics - AI/ML Model development - AWS - Deep Learning - Microsoft Azure",
        "experience_required": "7-9 Yrs"
      },
      {
        "title": "Urgent requirement For AI/ML Engineer.",
        "salary": "Not disclosed",
        "company": "Hinduja Global Solutions (HGS)",
        "location": "Bengaluru",
        "job_description": "Required skills: 4-8 years of hands-on experience in AI, machine learning, and NLP-focu... - NLP - Natural Language Processing - AIML - LLM - Python - ML Engineer - Artificial Intelligence - APIs",
        "experience_required": "5-8 Yrs"
      },
      {
        "title": "Ai Ml Engineer",
        "salary": "Not disclosed",
        "company": "Hurix",
        "location": "Chennai(Kilpauk)",
        "job_description": "Experience with fine-tuning multiple AI models in a single project or fine-tuning AI mo... - Tensorflow - Pytorch - fine tuning - Solutioning - Model Development - Project Management - AIML - Performance",
        "experience_required": "5-10 Yrs"
      },
      {
        "title": "Machine Learning Computer Vision Co-op/Intern",
        "salary": "",
        "company": "USG Corporation",
        "location": "Chicago, IL",
        "job_description": "As a company with $3B in revenues, we're big enough that our ... confident in senior leadership. Proficiency in Python programming.",
        "experience_required": ""
      },
      {
        "title": "Senior Data Analyst (Machine Learning/Automation)",
        "salary": "$118,000 Annually",
        "company": "American CyberSystems",
        "location": "Dallas, TX",
        "job_description": "Innova Solutions is immediately hiring for a Senior Data Analyst (Machine Learning/Automation) Position type: Full-time Duration: permanent Location: Hybrid, Dallas Texas Mostly remote, except once a ...",
        "experience_required": ""
      },
      {
        "title": "Sr. Applied Machine Learning Engineer",
        "salary": "$140K to $200K Annually",
        "company": "Snorkel AI",
        "location": "Remote, OR",
        "job_description": "As an Applied Machine Learning Engineer, you'll research and utilize established and state-of-the-art machine learning (ML) techniques to successfully deliver solutions to our customers.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$180K to $230K Annually",
        "company": "TruckSmarter",
        "location": "San Francisco, CA",
        "job_description": "As our first Senior Machine Learning Engineer, you will be responsible for building machine learning models, the corresponding data pipelines and the local and production training and ...",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$112K to $197K Annually",
        "company": "Allstate Insurance Co.",
        "location": "Remote, OR",
        "job_description": "As a Senior Machine Learning Engineer (MLE), you relish the challenge of solving business problems using the latest techniques and tools to bring models to life that deliver business value.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$180K to $200K Annually",
        "company": "Boulder Imaging Inc",
        "location": "Louisville, CO",
        "job_description": "Boulder Imaging is seeking a Senior Machine Learning Engineer to contribute to the development and enhancement of our cutting-edge vision-based inspection, metrology, and high-performance digital ...",
        "experience_required": ""
      },
      {
        "title": "Senior Data Scientist, Machine Learning",
        "salary": "$160K to $200K Annually",
        "company": "Serve Robotics",
        "location": "Los Angeles, CA",
        "job_description": "We are looking for a talented Senior Data Scientist who bridges the gap between ML infrastructure and ML engineers. The ideal candidate possesses strong fundamentals in machine learning, with the ...",
        "experience_required": ""
      },
      {
        "title": "Manager, Product Manager, Enterprise Machine Learning UI",
        "salary": "",
        "company": "Capitalone",
        "location": "Chicago, IL",
        "job_description": "Machine learning is at the heart of our approach. We provide millions of customers with ... They are comfortable in conversation with stakeholders ranging from technical customers to senior ...",
        "experience_required": ""
      },
      {
        "title": "Machine Learning Scientist II/Sr Machine Learning Scientist",
        "salary": "$145K to $250K Annually",
        "company": "Iambic Therapeutics, Inc",
        "location": "San Diego, CA",
        "job_description": "We are seeking a skilled Senior Machine Learning Scientist to join our team at the Iambic Therapeutics. In this role, you will work to design, develop, train, benchmark, and deploy one ...",
        "experience_required": ""
      },
      {
        "title": "Senior Software Engineer, Machine Learning",
        "salary": "$349K to $558K Annually",
        "company": "Kikoff Inc",
        "location": "San Francisco, CA",
        "job_description": "We are seeking a Senior Machine Learning Engineer to join our team. This role will focus on developing and maintaining machine learning infrastructure and operations, particularly for our cash ...",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$130K to $165K Annually",
        "company": "Keeling Labs",
        "location": "Los Angeles, CA",
        "job_description": "Our Mission Founded in 2022, Keeling Labs was started as a place to develop and apply machine learning to solve the world's biggest problem--climate change. Our current priority is getting the grid ...",
        "experience_required": ""
      },
      {
        "title": "Jr. Software Engineer - Machine Learning",
        "salary": "$50 to $65 Hourly",
        "company": "GCR Technical Staffing",
        "location": "San Diego, CA",
        "job_description": "As a Machine Learning Engineer on our core Software AI team, you will be at the forefront of ... Communicate the results and insights effectively to partners and senior leaders, providing clear ...",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer (Prompt)",
        "salary": "$180K to $200K Annually",
        "company": "Assured",
        "location": "Palo Alto, CA",
        "job_description": "As a Senior Machine Learning Engineer (Prompt), you will be responsible for designing, testing, and iterating on prompt structures to ensure optimal outputs from large language models (LLMs). You ...",
        "experience_required": ""
      },
      {
        "title": "Sr. Machine Learning Infrastructure Engineer, Tesla Bot",
        "salary": "$116,000 Annually",
        "company": "Tesla Motors",
        "location": "Palo Alto, CA",
        "job_description": "Understanding of modern machine learning concepts and state of the art deep learning. Experience working with training frameworks, ideally PyTorch. Demonstrated experience scaling neural network ...",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Operations Engineer",
        "salary": "$141K to $168K Annually",
        "company": "SciTec",
        "location": "Boulder, CO",
        "job_description": "We are seeking an experienced Machine Learning Operations (MLOps) Engineer to join and help shape our new MLOps team. This role focuses on deploying and optimizing machine learning models ...",
        "experience_required": ""
      },
      {
        "title": "Senior AI/Machine Learning Engineer (Remote)",
        "salary": "$170K to $210K Annually",
        "company": "Citizen Health",
        "location": "San Mateo, CA",
        "job_description": "We're seeking a Senior Machine Learning Engineer to lead the development and deployment of cutting-edge AI solutions that power our patient-centric platform. This role is crucial in ...",
        "experience_required": ""
      },
      {
        "title": "Senior / Staff Machine Learning Engineer",
        "salary": "$158K to $269K Annually",
        "company": "Waabi",
        "location": "San Francisco, CA",
        "job_description": "You will... - Contribute and build the self-driving engineering foundations to develop the next generation autonomy software across many machine learning projects ...",
        "experience_required": ""
      },
      {
        "title": "GenAI/Machine Learning Technical Project Manager",
        "salary": "",
        "company": "Deloitte US",
        "location": "Chicago, IL",
        "job_description": "This person will help build Human Capital. GenAI/Machine Learning certification. Scrum Master Certification. PMP or other accredited Project ...",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$165K to $200K Annually",
        "company": "Statsig, Inc",
        "location": "Bellevue, WA",
        "job_description": "Statsig is seeking a highly skilled Senior Machine Learning Engineer to pioneer and shape our Machine Learning initiatives. You will be a lead developer responsible for setting ...",
        "experience_required": ""
      },
      {
        "title": "Sr Principal AI Researcher/Machine Learning Engineer (Cortex)",
        "salary": "$147K to $203K Annually",
        "company": "Palo Alto Networks",
        "location": "Santa Clara, CA",
        "job_description": "We're seeking a talented and experienced Sr Principal AI Researcher to ... Published research in AI/ML, with an advanced degree in Computer Science, Machine Learning ...",
        "experience_required": ""
      },
      {
        "title": "Senior Software Engineer, Machine Learning",
        "salary": "$349K to $558K Annually",
        "company": "Kikoff Inc",
        "location": "San Francisco, CA",
        "job_description": "We are seeking a Senior Machine Learning Engineer to join our team. This role will focus on developing and maintaining machine learning infrastructure and operations, particularly for our cash.",
        "experience_required": ""
      },
      {
        "title": "Jr. Software Engineer - Machine Learning",
        "salary": "$50 to $65 Hourly",
        "company": "GCR Technical Staffing",
        "location": "San Diego, CA",
        "job_description": "As a Machine Learning Engineer on our core Software AI team, you will be at the forefront of... Communicate the results and insights effectively to partners and senior leaders, providing clear.",
        "experience_required": ""
      },
      {
        "title": "Sr. Machine Learning Infrastructure Engineer, Tesla Bot",
        "salary": "$116,000 Annually",
        "company": "Tesla Motors",
        "location": "Palo Alto, CA",
        "job_description": "Build and improve tooling to deploy trained neural nets to Tesla hardware Requirements: Practical experience programming in Python and/or C++ Proficient in system-level.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$180K to $230K Annually",
        "company": "TruckSmarter",
        "location": "San Francisco, CA",
        "job_description": "As our first Senior Machine Learning Engineer, you will be responsible for building machine learning models, the corresponding data pipelines and the local and production training.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Operations Engineer",
        "salary": "$141K to $168K Annually",
        "company": "SciTec",
        "location": "Boulder, CO",
        "job_description": "We are seeking an experienced Machine Learning Operations (MLOps) Engineer to join and help shape our new MLOps team. This role focuses on deploying and optimizing machine learning models.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$180K to $200K Annually",
        "company": "Boulder Imaging Inc",
        "location": "Louisville, CO",
        "job_description": "Boulder Imaging is seeking a Senior Machine Learning Engineer to contribute to the development and enhancement of our cutting-edge vision-based inspection, metrology, and high-performance digital.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$130K to $165K Annually",
        "company": "Keeling Labs",
        "location": "Los Angeles, CA",
        "job_description": "We're hiring for an ambitious, experienced machine learning engineer to help us scale our technology and impact in the grid. We're looking for someone with experience developing and.",
        "experience_required": ""
      },
      {
        "title": "Sr Principal Engineer Machine Learning (MLA) Verification (AI2293)",
        "salary": "$240K to $317K Annually",
        "company": "SiMa Technologies",
        "location": "San Jose, CA",
        "job_description": "The MLA Design Verification (DV) team at SiMa is involved in the.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer (Prompt)",
        "salary": "$180K to $200K Annually",
        "company": "Assured",
        "location": "Palo Alto, CA",
        "job_description": "As a Senior Machine Learning Engineer (Prompt), you will be responsible for designing, testing, and iterating on prompt structures to ensure optimal outputs from large language models (LLMs).",
        "experience_required": ""
      },
      {
        "title": "Staff, Software Engineer (Machine Learning Engineer) | Pricing Team",
        "salary": "$143K to $286K Annually",
        "company": "Walmart",
        "location": "San Mateo, CA",
        "job_description": "Walmart Global Tech is looking for a highly skilled Staff Machine Learning Engineer to join our... As a Senior Data MLE, you will play a critical role in driving innovation and optimizing revenue.",
        "experience_required": ""
      },
      {
        "title": "Sr. Machine Learning (ML) Engineer",
        "salary": "$104K to $143K Annually",
        "company": "Synergy BIS",
        "location": "Remote, OR",
        "job_description": "As a Senior Machine Learning (ML) Engineer with Synergy, you will join the team supporting the mission of the Officer of the Chief Information Officer for a Federal government agency.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$143K to $230K Annually",
        "company": "CoStar Realty Information, Inc.",
        "location": "San Diego, CA",
        "job_description": "CoStar delivers real-time, verified real estate data that helps clients confidently spot great opportunities and make smart choices ahead of.",
        "experience_required": ""
      },
      {
        "title": "Senior Software Engineer, Machine Learning (Ads)",
        "salary": "$202K to $222K Annually",
        "company": "Discord",
        "location": "San Francisco, CA",
        "job_description": "We are looking for a Senior Software Engineer specializing in Machine Learning to join our Revenue ML team at Discord. This team partners with our revenue product groups, focusing on both consumer.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$143K to $230K Annually",
        "company": "CoStar",
        "location": "San Diego, CA",
        "job_description": "CoStar delivers real-time, verified real estate data that helps clients confidently spot great opportunities and make smart choices ahead of.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer, Multimodality & Data",
        "salary": "$160 Hourly",
        "company": "Scribe",
        "location": "San Francisco, CA",
        "job_description": "We are seeking a highly motivated and skilled Machine Learning / Applied Research Engineer to join our team. You will work on cutting-edge research projects to build the future of agents.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$143K to $230K Annually",
        "company": "CoStar Group",
        "location": "San Diego, CA",
        "job_description": "CoStar delivers real-time, verified real estate data that helps clients confidently spot great opportunities and make smart choices ahead of.",
        "experience_required": ""
      },
      {
        "title": "Senior Machine Learning Engineer",
        "salary": "$165K to $200K Annually",
        "company": "Statsig, Inc",
        "location": "Bellevue, WA",
        "job_description": "Statsig is seeking a highly skilled Senior Machine Learning Engineer to pioneer and shape our Machine Learning initiatives. You will be a lead developer responsible for setting.",
        "experience_required": ""
      },
      {
        "title": "Lead Machine Learning Engineer (Hybrid/ U.S. Citizens Only)",
        "salary": "$170K to $225K Annually",
        "company": "Task Force Talent",
        "location": "Salt Lake City, UT",
        "job_description": "Task Force Talent is seeking senior machine learning engineers (possibly multiple openings for strong candidates) for a well-funded Series C company working on insider threat and supply chain.",
        "experience_required": ""
      },
      {
        "title": "Engineer, Senior-Machine learning",
        "salary": "",
        "company": "Qualcomm",
        "location": "Hyderabad, India",
        "job_description": "As a leading technology innovator, Qualcomm pushes the boundaries of what's possible to enable next-generation experiences and drives digital transformation to help create a smarter, connected future for all. As a Qualcomm Software Engineer, you will design, develop, create, modify, and validate embedded and cloud edge software, applications, and/or specialized utility programs that launch cutting-edge, world class products that meet and exceed customer needs. Qualcomm Software Engineers collaborate with systems, hardware, architecture, test engineers, and other teams to design system-level software solutions and obtain information on performance requirements and interfaces. Minimum Qualifications: Bachelor's degree in Engineering, Information Systems, Computer Science, or related field and 2+ years of Software Engineering or related work experience. OR Master's degree in Engineering, Information Systems, Computer Science, or related field and 1+ year of Software Engineering or related work experience. OR PhD in Engineering, Information Systems, Computer Science, or related field. 2+ years of academic or work experience with Programming Language such as C, C++, Java, Python, etc. Preferred Qualifications: Master's Degree in Engineering, Information Systems, Computer Science or related field. 4+ years of Software Engineering or related work experience. 2+ years of experience with Database Management Software. 2+ years of experience with API. 1+ year of work experience with Git, Perforce, or Source Code Management System. Principal Duties and Responsibilities: Applies Software knowledge and experience to design, develop, create, modify, and validate embedded and cloud edge software, applications, and/or specialized utility programs. Analyzes user needs and software requirements to design and customize software for optimal operational efficiency. Designs and implements software modules for products and systems. Participates in the design, coding for large features, unit testing, significant debugging fixes, and integration efforts to ensure projects are completed to specifications and schedules. Performs code reviews and regression tests as well as triages and fixes issues to ensure the quality of code. Collaborates with others inside project team to accomplish project objectives. Writes technical documentation for Software projects. Level of Responsibility: Works under supervision. Decision-making may affect work beyond immediate work group. Requires verbal and written communication skills to convey information. May require basic negotiation, influence, tact, etc. Tasks do not have defined steps planning, problem-solving, and prioritization must occur to complete the tasks effectively.",
        "experience_required": "2-4 Years"
      },
      {
        "title": "Senior ML Lead",
        "salary": "",
        "company": "BlackRock Real Estate",
        "location": "Gurugram, India",
        "job_description": "Chief Data Office (CDO) is a Mars Wrigley program that harnesses the power of data and insights to solve some of the critical business-wide problems we face - unlocking quality growth and excellence.\n\nThrough CDO, we deliver connected insights across the entire Snacking ecosystem. We empower our Associates with the right data, tools and capabilities so they can take decisive action, maximizing value and making a meaningful impact on our consumers, our customers and our business.\n\nThe Sr. ML Lead will be the principal solution architect within Mars Snacking with the responsibility of making sure that each application is designed keeping in mind the AI strategy for Mars Snacking.\n\nThis position will also be responsible to guide and mentor the more junior members of the Data Science community.\n\nWhat are we looking for\n- 7+ years of experience working in a quantitative role preferably in the CPG, or retail industry.\n- 4+ years of experience managing a team of data scientists, product analysts or data analysts\n- Proven track record of delivering value through AI/ Data Science products in a fast-paced, environment using a scalable and reusable codebase and models to address business problems effectively.\n- Partner with business across functions to identify business challenges and opportunities and translate them unto actionable, integrated, data-driven solutions.\n- Eagerness to learn, flexibility to pivot when needed, savviness to navigate and thrive in a dynamic environment, and a growth mindset needed to build a successful team\n- An understanding of product management principles such as product definition, roadmap building and management, and product releases and commercialization\n- A strong customer centric mindset especially within an internal customer base with the purpose of driving value creation, adoption and use\n- Strategic thinking, problem solving and innovation, with the ability to anticipate and navigate challenges and opportunities.\n- Ensure compliance with analytics standards, including tailoring methodologies to specific use case needs such as ML, AI, and descriptive analytics.\n- Ability to translate business needs into analytical frameworks & superior verbal and written communication skills\n- Proficiency and hands-on experience in advanced analytics techniques and machine learning algorithms, including NLP, time-series analysis and other relevant methods and willingness to coach data scientists tactically\n- Working understanding of ML Ops and DevOps frameworks\n- Familiarity with Microsoft Azure tech stack, including but not limited to Azure Data Factory, Synapse Analytics, Databricks, GCP\n\nWhat will be your key responsibilities\n- Applies strong expertise in AI through use of machine learning, data mining, and statistical models to design, prototype and build next generation ML engines and services\n- Design, architect and review technical architecture of data science solutions\n- Plan and lead data science projects that cover a diverse range of business problems\n- Serve as key point of contact with Data Engineering and DevOps teams, for solution architecture and infrastructure design\n- Review work of team members identifying optimum methodologies, advising on implementation, and checking business logic\n- Use machine learning techniques, visualizations, & statistical analysis to gain insight into various data sets - some readily available, and some you create and curate yourself\n- Collaborate with internal and external teams to ensure we focus on product and service recommendations and be a key player in our network of talent\n- Contribute to a high performing data science function\n- Create repeatable, interpretable, dynamic and scalable models that are seamlessly incorporated into analytic data products\n- Performance Monitoring: Define key performance indicators (KPIs) and implement monitoring systems for deployed data platforms and products to ensure efficient operations data operations, effective support services and incident management.\n- Solution ideation and Development: Guide a team of data scientists to create fit for purpose solutions using cutting edge analytical and AI methodologies.\n- Focus on setting up a Data Science AI program and delivery methodology: Entails, recruiting and forming a team to solve a specific problem elaborating on a programmatic mindset and tracking value delivery\n\nWhat can you expect from Mars\n- Work with diverse and talented Associates, all guided by the Five Principles.\n- Join a purpose driven company, where we're striving to build the world we want tomorrow, today.\n- Best-in-class learning and development support from day one, including access to our in-house Mars University.\n- An industry competitive salary and package, including company bonus.",
        "experience_required": "7-9 Years"
      },
      {
        "title": "Machine Learning Architect",
        "salary": "",
        "company": "Antal International Network",
        "location": "Chennai, India",
        "job_description": "Key Responsibilities:\n- ML Solution Architecture: Design and develop scalable AI/ML architectures with a focus on Deep Learning, Large Language Models (LLMs), and Natural Language Processing (NLP).\n- Model Optimization: Enhance model efficiency, reduce latency, and optimize memory usage for real-time document processing.\n- ML Infrastructure Development: Build and manage MLOps pipelines for experimentation, A/B testing, and deployment.\n- LLM Pipeline Development: Develop and optimize pipelines using LangChain, LlamaIndex, and other AI frameworks.\n- AI Strategy & Solutioning: Collaborate with cross-functional teams to align AI models with business objectives.\n- Automation & Scalability: Create scalable and automated AI workflows for intelligent document processing.\n- Research & Innovation: Stay updated on the latest AI advancements and integrate cutting-edge ML techniques into the platform.\n\nRequired Qualifications:\n- Experience: 8+ years in AI/ML within a software or product company.\n- Expertise: Strong background in Deep Learning, Large Language Models (LLMs), and NLP (e.g., BERT, GPT, RoBERTa).\n- Programming: Proficiency in Python with hands-on experience in ML frameworks like PyTorch, TensorFlow, LangChain, and SpaCy.\n- LLM Experience: Practical experience with LLaMA, Zephyr, Mistral, and OpenAI APIs.\n- MLOps & Deployment: Expertise in MLOps, cloud deployment, and AI model optimization.\n- Problem-Solving: Strong analytical skills and a product-first mindset.\n\nDate Posted: 06/02/2025",
        "experience_required": "8-10 Years"
      },
      {
        "title": "Software Engineer, Machine Learning Compilers, Silicon",
        "salary": "",
        "company": "Google",
        "location": "Bengaluru, India",
        "job_description": "Minimum qualifications:\n- Bachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\n- 5 years of experience with software development in C++, and with data structures/algorithms.\n- 3 years of experience testing, maintaining, or launching software products, with 1 year of experience with software design and architecture.\n\nPreferred qualifications:\n- Master's degree or PhD in Computer Science, or a related technical field.\n- Experience in power and performance optimizations.\n- Experience with domain-specific compilers for machine learning.\n- Knowledge of hardware that provides a degree of parallelism.\n\nAbout the job\nBe part of a diverse team that pushes boundaries, developing custom silicon solutions that power the future of Google's direct-to-consumer products. You'll contribute to the innovation behind products loved by millions worldwide. Your expertise will shape the next generation of hardware experiences, delivering unparalleled performance, efficiency, and integration.\n\nAs a Software Engineer, you will work on developing Machine Learning (ML) compilers for the Tensor TPU to accelerate machine learning models running on custom hardware accelerators. In this role, you will manage project priorities, deadlines, and deliverables.\n\nGoogle's mission is to organize the world's information and make it universally accessible and useful. Our team combines the best of Google AI, Software, and Hardware to create radically helpful experiences. We research, design, and develop new technologies and hardware to make computing faster, seamless, and more powerful. We aim to make people's lives better through technology.\n\nResponsibilities\n- Build compilers and tools that map Machine Learning models to the hardware Information Security Assurance.\n- Evaluate various trade-offs of different parallelization strategies such as performance, power, energy, and memory consumption.\n- Collaborate with machine learning researchers to improve the domain-specific compiler.\n- Collaborate with hardware engineers to evolve future accelerators.\n\nMore Info\nFunction: Software Development\nJob Type: Permanent Job\n\nSkills Required\nPower and Performance Optimizations\nDomain-Specific Compilers for Machine Learning\nSoftware Design\nAlgorithms\nData Structures\n\nDate Posted: 06/02/2025",
        "experience_required": "5-7 Years"
      },
      {
        "title": "Senior Data Scientist (GenAI)",
        "salary": "",
        "company": "Roche Pharmacutical Holding",
        "location": "Hyderabad, India",
        "job_description": "Roche fosters diversity, equity and inclusion, representing the communities we serve. When dealing with healthcare on a global scale, diversity is an essential ingredient to success. We believe that inclusion is key to understanding people's varied healthcare needs. Together, we embrace individuality and share a passion for exceptional care. Join Roche, where every voice matters.\n\nAs a Senior Data Scientist, specializing in Generative AI, you would lead development of a business solution through advanced NLP techniques in an agile delivery mode, working directly with partners in the business teams from Roche affiliates across the globe.\n\nYour Opportunity:\n- Work independently and/or lead team of Data Scientists to design and develop pipelines for Develop and implement enterprise-level GenAI models and tools to solve business problems\n- Work with partners throughout the organization to identify opportunities for leveraging company data to drive business solutions\n- Conduct research to identify emerging trends and technologies in Gen AI and other areas of data science\n- Build toolsets and re-usable components for our future projects and ideas and automate the AI solution to achieve maximum efficiency\n- Write modularized, production ready code that is easily scalable across data volume and business functions\n- Lead project delivery with your Manager through regular meetings, extensive documentation and clear timeline setting\n- Develop processes and tools to monitor and analyze model performance and data accuracy\n- Train junior team members on NLP and ML techniques\n\nWho You Are:\n- You hold a bachelor degree with 5-8 years of experience in the Data Science and Generative AI. Preferably, you have a Master's in Data Science, Machine Learning, Statistics, Economics/Econometrics, Computer Science or related field)\n- Certifications on AI/ML/Data science would be an added advantage\n- Understanding of basic concepts in Text Mining, NLP and NLU, hands-on experience with regular expressions\n- Prompt Engineering: be able to craft effective prompts and instructions to guide models towards desired outputs, ensuring coherence, factual accuracy, and alignment with ethical considerations\n- Model Optimization: Leverage techniques like RAG, Fine tuning to optimize models\n- Experience with modern deep learning architectures for NLP (encoder-decoder, transformers, attention), including: a) hands-on experience with using transformers like Huggingface, SBert, GPT-2/GPT-3 b) capability to build ML/DL pipeline for training/tuning model (including transfer learning)\n- Knowing Docker, Kubernetes and cloud platforms (especially AWS) is added advantage\n- General understanding of AGILE Project Delivery process\n- Excellent written and verbal communication skills for coordinating across teams\n- Strong analytic approach and logical thinking capability, strong QC approach.",
        "experience_required": "5-8 Years"
      }
    ]
  }
]