[
  {
    "jobs": [
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Data-Scientist-engineer-required-for-Algorithm-Design-work_~021876505453137242964/",
        "title": "Data Scientist/ML engineer required for Algorithm Design work",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Generative Model, Microsoft Azure, Statistics, Artificial Intelligence, Data Science, Flask, Docker Compose, Docker, Data Analysis, Python, PyTorch, Word Embedding, Gradient Boosting, Logistic Regression, Cluster Computing, Bayesian Statistics, Autoencoder, Anomaly Detection, Decision Tree, Linear Regression, Classification, Recommendation System, Model Tuning, Machine Learning Model, Feature Extraction, Computer Vision, TensorFlow, Python Scikit-Learn",
        "date of posting": "2025-01-06",
        "job_description": "We are looking for a Data Scientist/ML engineer to assist with algorithm design work. If you represent an agency please do not apply. Your application will be ignored if you make a low effort GPT based application.",
        "experience_required": "Entry"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Monte-Carlo-Tree-Search-Expert-for-Consultation-Reinforcement-Learning-Project_~021876618754152213332/",
        "title": "Monte Carlo Tree Search Expert for Consultation in Reinforcement Learning Project",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, PyTorch, Data Science",
        "date of posting": "2025-01-06",
        "job_description": "I am looking for an expert in Monte Carlo Tree Search (MCTS) to provide a few hours of consultation for my reinforcement learning project.",
        "experience_required": "Expert"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Create-Engaging-Simulations-Virtual-Fruit-Fly-Behavior_~021879930628189771658/",
        "title": "Create Engaging Simulations of Virtual Fruit Fly Behavior",
        "salary": "",
        "company": "Eon",
        "location": "",
        "skillset": "Reinforcement Learning, NumPy, Visualization",
        "date of posting": "2025-01-17",
        "job_description": "We at Eon are seeking a talented computational neuroscientist or software developer to help bring our vision of 'digital twin' models to life through engaging simulations of virtual fruit fly behavior.",
        "experience_required": "Intermediate"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/OpenCV-learning-Guidance-for-Pick-and-Place-Prototype_~021878042762595409425/",
        "title": "OpenCV & Q-learning Guidance for Pick and Place Prototype",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Android, OpenCV, Computer Vision, Python",
        "date of posting": "2025-01-11",
        "job_description": "I am seeking a skilled professional to assist with developing a pick and place system using OpenCV and Q-learning while navigating obstacles.",
        "experience_required": "Intermediate"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Machine-Learning-Engineer-for-Health-Tech-Startup_~021886170451248463375/",
        "title": "Machine Learning Engineer for Health Tech Startup",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Data Science, Artificial Intelligence, Python",
        "date of posting": "2025-02-03",
        "job_description": "Hi! We’re looking to hire another hardworking and creative MLE to help train innovative new AI systems for healthcare. We’re focused on developing cutting-edge solutions.",
        "experience_required": "Intermediate"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Edit-the-article-that-ready-for-publication-based-feedback-from-reviewer_~021879458197380281690/",
        "title": "Edit the article that ready for publication based on feedback from reviewer",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Research Papers, Academic Writing",
        "date of posting": "2025-01-15",
        "job_description": "We are seeking a skilled researcher to conduct a re-edit of the paper based on the reviewer feedback for the article (Federated Learning Enabled).",
        "experience_required": "Expert"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/JetBot-Real-Time-Tracking-and-Obstacle-Avoidance-using-Multimodel-with-Reinforcement-Learning_~021880331246111839097/",
        "title": "JetBot Real-Time Tracking and Obstacle Avoidance using Multimodel with Reinforcement Learning",
        "salary": "$500",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Robotics, Computer Vision, OpenCV",
        "date of posting": "2025-01-20",
        "job_description": "Real-Time Person Tracking and Obstacle Avoidance using NVIDIA JetBot: The idea is to use Nvidia JetBot robot and integrate YOLO for object detection and tracking.",
        "experience_required": "Expert"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Reinforcement-Learning-Training-Expert_~021886570197392059707/",
        "title": "Reinforcement Learning Training Expert",
        "salary": "$1,500",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Python, Deep Neural Network, Neural Network, PyTorch, Computer Vision",
        "date of posting": "2025-02-04",
        "job_description": "Job Overview: I am looking for an expert in reinforcement learning (RL) training for large language models (LLMs) who can analyze, replicate, and improve existing models.",
        "experience_required": "Expert"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Development-Innovative-Financial-Algorithm_~021882281024941701788/",
        "title": "Development of Innovative Financial Algorithm",
        "salary": "",
        "company": "",
        "location": "",
        "skillset": "Reinforcement Learning, Artificial Intelligence, Financial Modeling, Algorithm Development, Financial Analysis, Python",
        "date of posting": "2025-01-23",
        "job_description": "We are seeking a skilled developer to create a cutting-edge financial algorithm tailored to our unique needs. The ideal candidate will have experience in financial modeling and algorithm development.",
        "experience_required": "Intermediate"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Reinforcement-Learning-Training-Expert_~021886570197392059707/",
        "title": "Reinforcement Learning Training Expert",
        "salary": "$1,500.00",
        "company": "Individual client",
        "location": "Abu Dhabi, United Arab Emirates",
        "skillset": "Deep Learning, AI Model Training, Computer Vision, Neural Network, Deep Neural Network, Python, Reinforcement Learning, Deep Learning",
        "date of posting": "2025-02-04",
        "job_description": "I am looking for an expert in reinforcement learning (RL) training for large language models (LLMs) who can analyze, replicate, and implement aspects of the DeepSeek-V3-R1 training methodology. While DeepSeek has not released training code, I aim to integrate some of their training logic into my existing framework for experimentation. Key Responsibilities: • Implement reinforcement learning training strategies inspired by DeepSeek-V3-R1. • Modify and extend my existing training code to integrate new logic. • Optimize the training process for scalability and efficiency. • Collaborate with me to brainstorm, test, and refine experimental components. Required Skills & Expertise: • Expert-level proficiency in Python and deep learning frameworks (PyTorch preferred). • Strong experience with LLM and Vision-Language Model (VLM) training. • Deep understanding of reinforcement learning techniques for LLMs. • Familiarity with distributed training and scaling experiments. • Ability to write clean, modular, and well-documented code. Preferred Qualifications: • Prior experience with RLHF (Reinforcement Learning with Human Feedback) or RL-based fine-tuning of LLMs. • Understanding of DeepSeek-V3-R1’s training innovations. • Experience working with multi-GPU training. Project Scope: • The base training code is already available. • Your main task is to implement specific experimental modifications. • You will receive clear guidance on the required changes.",
        "experience_required": "Expert"
      },
      {
        "url": "https://www.upwork.com/freelance-jobs/apply/Reinforcement-learning_~021878154945947044798/",
        "title": "Reinforcement learning",
        "salary": "$100.00",
        "company": "Individual client",
        "location": "Orlando, United States",
        "skillset": "Artificial Neural Network, TensorFlow, Deep Learning, Machine Learning, Python, Neural Network, Reinforcement Learning, Deep Neural Network, Keras",
        "date of posting": "2025-01-11",
        "job_description": "I want to create a realistic environment for an RL-based commuting experiment in Riyadh city. The goal is to build a simulation where an agent can make optimal decisions about driving, parking, and taking the metro to minimize travel time, cost, and environmental impact.\n\nProject Scope:\n\n1. Data Acquisition:\n• Obtain accurate geospatial data for Riyadh’s road network and metro system using OpenStreetMap or other reliable sources.\n\n2. Environment Development:\n• Use tools like SUMO (Simulation of Urban Mobility) or MATSim to create a realistic simulation of Riyadh’s traffic and metro system.\n• Integrate road traffic, metro lines, stations, and parking zones into the simulation.\n\n3. Reinforcement Learning Integration:\n• Build a custom OpenAI Gym-compatible environment where an RL agent can interact with the simulation.\n• Define states, actions, and rewards for the agent:\n• States: Current location, time of day, mode of transportation, distance to nearest metro station, parking availability.\n• Actions: Drive, park, take the metro, continue driving.\n• Rewards: Minimize total travel time, cost, and environmental impact.\n\n4. Testing and Evaluation:\n• The freelancer will help set up a framework for training and evaluating the RL agent’s performance under different traffic conditions.",
        "experience_required": "Expert"
      }
    ]
  }
]